## Analisi Dataset

In [155]:
!pip install pandas -q
!pip install pandas-profiling -q
!pip install numpy -q

In [156]:
import pandas as pd
import numpy as np

### **ariregister.rik.ee**

#### Formato .csv

In [157]:
ar1 = pd.read_csv("de-sources-2022-2023/ariregister.rik.ee/wissel-activity-ariregister.rik.ee.csv")
ar1.tail(5)

,ID azienda,Area of Activity,EMTAK Code,NACE Code,Source
1010,1463,Other information technology and computer serv...,62091 (EMTAK 2008),62.09,Electronic submission\n ...
1011,1464,"Other professional, scientific and technical a...",74901 (EMTAK 2008),74.90,Annual report\n ...
1012,1465,Retail sale via mail order houses or via Internet,47911 (EMTAK 2008),47.91,Annual report\n ...
1013,1466,Manufacture of furniture n.e.c.,31091 (EMTAK 2008),31.09,Annual report\n ...
1014,1470,Other business support service activities n.e.c.,82991 (EMTAK 2008),82.99,Electronic submission\n ...

In [158]:
ar1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1015 entries, 0 to 1014
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID azienda        1015 non-null   int64
 1   Area of Activity  1015 non-null   object
 2   EMTAK Code        1015 non-null   object
 3   NACE Code         1015 non-null   float64
 4   Source            1015 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 39.8+ KB

In [159]:
ar1.dtypes

ID azienda            int64
Area of Activity     object
EMTAK Code           object
NACE Code           float64
Source               object
dtype: object

In [160]:
ar1.isnull().sum()

ID azienda          0
Area of Activity    0
EMTAK Code          0
NACE Code           0
Source              0
dtype: int64

In [161]:
ar2 = pd.read_csv("de-sources-2022-2023/ariregister.rik.ee/wissel-aziende-ariregister.rik.ee.csv")
ar2.tail(5)

,URL,ID,Name,Code,Legal form,Status,Registration Date,Capital,Address,Deletion Date
1464,https://ariregister.rik.ee/eng/company/1165596...,1465,OÃœYESPARMÃ–Ã–BEL(11655968),11655968.0,Private limited company,Enteredintotheregister,10.06.2009,Capitalis2Â 520Â â‚¬,Tartu maakond Tartu li...,NaN
1465,https://ariregister.rik.ee/eng/company/1132968...,1466,OsaÃ¼hingYespartner(11329683),11329683.0,Private limited company,Deleted,11.12.2006,NaN,NaN,19.10.2011
1466,https://ariregister.rik.ee/eng/company/1227478...,1467,YespartnerOÃœ(12274783),12274783.0,Private limited company,Deleted,30.04.2012,NaN,NaN,07.07.2017
1467,https://ariregister.rik.ee/eng/company/1172619...,1468,YespatronOÃœ(11726199),11726199.0,Private limited company,Deleted,28.09.2009,NaN,NaN,04.07.2013
1468,https://ariregister.rik.ee/eng/company/1469261...,1469,YKSEhituspartnerOÃœ(14692616),14692616.0,Private limited company,Enteredintotheregister,28.03.2019,Capitalis2Â 508Â â‚¬,Harju maakond Tallinn ...,NaN

In [162]:
ar2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1469 entries, 0 to 1468
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   URL                1469 non-null   object
 1   ID                 1469 non-null   int64
 2   Name               1469 non-null   object
 3   Code               1466 non-null   float64
 4   Legal form         1469 non-null   object
 5   Status             1437 non-null   object
 6   Registration Date  1466 non-null   object
 7   Capital            896 non-null    object
 8   Address            968 non-null    object
 9   Deletion Date      458 non-null    object
dtypes: float64(1), int64(1), object(8)
memory usage: 114.9+ KB

In [163]:
ar2.dtypes

URL                   object
ID                     int64
Name                  object
Code                 float64
Legal form            object
Status                object
Registration Date     object
Capital               object
Address               object
Deletion Date         object
dtype: object

In [164]:
ar2.isnull().sum()

URL                     0
ID                      0
Name                    0
Code                    3
Legal form              0
Status                 32
Registration Date       3
Capital               573
Address               501
Deletion Date        1011
dtype: int64

In [165]:
ar3 = pd.read_csv("de-sources-2022-2023/ariregister.rik.ee/wissel-partners-ariregister.rik.ee.csv")
ar3.tail(5)

,ID azienda,Name,Code,Participation,Contribution
1186,1465,\n Liri...,39212260062\n,100.00%,\n 2500.00 ...
1187,1466,\n Andr...,36607232737\n,42.50%,\n 1071.00 ...
1188,1466,\n Marg...,37801150228\n,42.50%,\n 1071.00 ...
1189,1466,\n Alek...,35311212719\n,15.00%,\n 378.00 EUR
1190,1470,\n,12067392\n,100.00%,\n 2508.00 ...

In [166]:
ar3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1191 entries, 0 to 1190
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID azienda     1191 non-null   int64
 1   Name           1191 non-null   object
 2   Code           1191 non-null   object
 3   Participation  1191 non-null   object
 4   Contribution   1191 non-null   object
dtypes: int64(1), object(4)
memory usage: 46.6+ KB

In [167]:
ar3.dtypes

ID azienda        int64
Name             object
Code             object
Participation    object
Contribution     object
dtype: object

In [168]:
ar3.isnull().sum()

ID azienda       0
Name             0
Code             0
Participation    0
Contribution     0
dtype: int64

In [169]:
ar4 = pd.read_csv("de-sources-2022-2023/ariregister.rik.ee/wissel-rappresentanti-ariregister.rik.ee.csv")
ar4.tail(5)

,ID azienda,Name,Code,Role,Start Date
1000,1463,\n Olajide Semi...,\n 37211260...,\n Management b...,02.12.2020
1001,1464,\n Kaidi Klein\...,\n 47104180...,\n Management b...,01.12.2015
1002,1465,\n Liridon Resh...,\n 39212260...,\n Management b...,22.05.2019
1003,1466,\n Margus L\xc3...,\n 37801150...,\n Management b...,31.07.2009
1004,1470,\n Hannes Rosin...,\n 37902090...,\n Management b...,17.07.2019

In [170]:
ar4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1005 entries, 0 to 1004
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID azienda  1005 non-null   int64
 1   Name        1005 non-null   object
 2   Code        1005 non-null   object
 3   Role        1005 non-null   object
 4   Start Date  1005 non-null   object
dtypes: int64(1), object(4)
memory usage: 39.4+ KB

In [171]:
ar4.dtypes

ID azienda     int64
Name          object
Code          object
Role          object
Start Date    object
dtype: object

In [172]:
ar4.isnull().sum()

ID azienda    0
Name          0
Code          0
Role          0
Start Date    0
dtype: int64

### **cbinsight.com**

#### Formato .csv

In [173]:
cbi1 = pd.read_csv("de-sources-2022-2023/cbinsight.com/DDD-cbinsight.com.csv")
cbi1.tail(5)

,Unnamed: 0,name,valuation,dateJoined,country,city,industry,investors,founded,stage,totalRaised
1180,1180,SpaceX,$127B,12/1/2012,United States,Hawthorne,Other,"Founders Fund, Draper Fisher Jurvetson, Rothen...",2002,Unattributed - VIII,$9.704B
1181,1181,Fanatics,$31B,6/6/2012,United States,Jacksonville,E-commerce & direct-to-consumer,"SoftBank Group, Andreessen Horowitz, Temasek H...",1995,Series I,$4.89B
1182,1182,Instacart,$39B,12/30/2014,United States,San Francisco,"Supply chain, logistics, & delivery","Khosla Ventures, Kleiner Perkins Caufield & By...",2012,Series I,$2.686B
1183,1183,Databricks,$38B,2/5/2019,United States,San Francisco,Data management & analytics,"Andreessen Horowitz, New Enterprise Associates...",2013,Corporate Minority,$3.497B
1184,1184,Stripe,$95B,1/23/2014,United States,San Francisco,Fintech,"Khosla Ventures, LowercaseCapital, capitalG",2010,Corporate Minority - II,$2.901B

In [174]:
cbi1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1185 entries, 0 to 1184
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1185 non-null   int64
 1   name         1185 non-null   object
 2   valuation    1185 non-null   object
 3   dateJoined   1185 non-null   object
 4   country      1185 non-null   object
 5   city         1169 non-null   object
 6   industry     1185 non-null   object
 7   investors    1185 non-null   object
 8   founded      1185 non-null   object
 9   stage        1185 non-null   object
 10  totalRaised  1185 non-null   object
dtypes: int64(1), object(10)
memory usage: 102.0+ KB

In [175]:
cbi1.dtypes

Unnamed: 0      int64
name           object
valuation      object
dateJoined     object
country        object
city           object
industry       object
investors      object
founded        object
stage          object
totalRaised    object
dtype: object

In [176]:
cbi1.isnull().sum()

Unnamed: 0      0
name            0
valuation       0
dateJoined      0
country         0
city           16
industry        0
investors       0
founded         0
stage           0
totalRaised     0
dtype: int64

#### Formato .json

In [177]:
cbi2 = pd.read_json('de-sources-2022-2023/cbinsight.com/iGMM-cbinsights.json')
cbi2.head()

,company,valuation,datejoined,country,city,industry,selectinvestors
0,ByteDance,$140,4/7/2017,China,Beijing,Artificial intelligence,"Sequoia Capital China, SIG Asia Investments, S..."
1,SpaceX,$127,12/1/2012,United States,Hawthorne,Other,"Founders Fund, Draper Fisher Jurvetson, Rothen..."
2,SHEIN,$100,7/3/2018,China,Shenzhen,E-commerce & direct-to-consumer,"Tiger Global Management, Sequoia Capital China..."
3,Stripe,$95,1/23/2014,United States,San Francisco,Fintech,"Khosla Ventures, LowercaseCapital, capitalG"
4,Canva,$40,1/8/2018,Australia,Surry Hills,Internet software & services,"Sequoia Capital China, Blackbird Ventures, Mat..."

In [178]:
cbi2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1202 entries, 0 to 1201
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   company          1202 non-null   object
 1   valuation        1202 non-null   object
 2   datejoined       1202 non-null   object
 3   country          1202 non-null   object
 4   city             1184 non-null   object
 5   industry         1202 non-null   object
 6   selectinvestors  1202 non-null   object
dtypes: object(7)
memory usage: 65.9+ KB

In [179]:
cbi2.dtypes

company            object
valuation          object
datejoined         object
country            object
city               object
industry           object
selectinvestors    object
dtype: object

In [180]:
cbi2.isnull().sum()

company             0
valuation           0
datejoined          0
country             0
city               18
industry            0
selectinvestors     0
dtype: int64

### **companiesmarketcap.com**

#### Formato .csv

In [181]:
cmc1 = pd.read_csv("de-sources-2022-2023/companiesmarketcap.com/MarScoToc-companiesmarketcap.com.csv")
cmc1.tail(10)

                               Name Master Cap    Country   Rank Share Price
6280                     Cardlytics    $0.17 B        USA  #6291       $5.25
6281                   Vera Bradley    $0.17 B        USA  #6292       $5.63
6282                   FingerMotion    $0.17 B        USA  #6293       $3.75
6283                    KCP Limited    $0.17 B      India  #6294       $1.34
6284               Excel Industries    $0.17 B      India  #6295      $13.76
6285                        Arteris    $0.17 B        USA  #6296       $5.18
6286               PlaySide Studios    $0.17 B  Australia  #6297       $0.43
6287  Alpine Summit Energy Partners    $0.17 B        USA  #6298       $4.53
6288                        Intevac    $0.17 B        USA  #6299       $6.79
6289                           Doma    $0.17 B        USA  #6300       $0.52

In [182]:
cmc1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6290 entries, 0 to 6289
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         6290 non-null   object
 1   Master Cap   6290 non-null   object
 2   Country      6116 non-null   object
 3   Rank         6290 non-null   object
 4   Share Price  6290 non-null   object
dtypes: object(5)
memory usage: 245.8+ KB

In [183]:
cmc1.dtypes

Name           object
Master Cap     object
Country        object
Rank           object
Share Price    object
dtype: object

In [184]:
cmc1.isnull().sum()

Name             0
Master Cap       0
Country        174
Rank             0
Share Price      0
dtype: int64

In [185]:
cmc2 = pd.read_csv("de-sources-2022-2023/companiesmarketcap.com/DDD-companiesmarketcap.com.csv")
cmc2.tail(10)

,Unnamed: 0,name,rank,marketcap,country,share_price,change1d,change1y,categories
7207,7207,Univest,5013,$0.75 B,usa,$25.65,-1.31%,-18.31%,investment financial-services insurance
7208,7208,Northfield Bancorp,5007,$0.75 B,usa,$15.77,0.06%,-8.53%,banks financial-services
7209,7209,Hanmi Financial,5003,$0.75 B,usa,$24.79,-0.84%,-7.22%,banks financial-services
7210,7210,CTI BioPharma\n,5000,$0.75 B,usa,$5.96,0.85%,168.47%,pharmaceuticals biotech
7211,7211,Protolabs,4999,$0.75 B,usa,$27.90,1.36%,-44.54%,3d-printing tech
7212,7212,ATN International,5008,$0.75 B,usa,$47.74,0.70%,17.10%,telecommunication
7213,7213,Al Moammar Information Systems,5010,$0.75 B,saudi-arabia,$25.04,0.32%,-29.21%,it-services
7214,7214,Karooooo,5014,$0.74 B,singapore,$24.20,-1.26%,-27.31%,software tech
7215,7215,Aerie Pharmaceuticals,5006,$0.75 B,usa,$15.25,0.00%,101.99%,pharmaceuticals biotech
7216,7216,Farmland Partners\n,5004,$0.75 B,usa,$13.51,0.15%,10.92%,real-estate investment reit

In [186]:
cmc2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7217 entries, 0 to 7216
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   7217 non-null   int64
 1   name         7217 non-null   object
 2   rank         7217 non-null   int64
 3   marketcap    7200 non-null   object
 4   country      7217 non-null   object
 5   share_price  7212 non-null   object
 6   change1d     7217 non-null   object
 7   change1y     7217 non-null   object
 8   categories   7217 non-null   object
dtypes: int64(2), object(7)
memory usage: 507.6+ KB

In [187]:
cmc2.dtypes

Unnamed: 0      int64
name           object
rank            int64
marketcap      object
country        object
share_price    object
change1d       object
change1y       object
categories     object
dtype: object

In [188]:
cmc2.isnull().sum()

Unnamed: 0      0
name            0
rank            0
marketcap      17
country         0
share_price     5
change1d        0
change1y        0
categories      0
dtype: int64

In [189]:
cmc3 = pd.read_csv("de-sources-2022-2023/companiesmarketcap.com/wissel-aziende-companiesmarketcap.com.csv")
cmc3.tail(10)

,Unnamed: 0,URL,ID,Name,Company code,Marketcap,Share price,Earnings,Revenue,Shares,Employees
6550,1390,https://companiesmarketcap.com/dolby/marketcap/,NaN,Dolby,DLB,$7.24 B,$75.47,$0.21 B,$1.25 B,100.213.000,2.368
6551,1391,https://companiesmarketcap.com/first-interstat...,NaN,First Interstate BancSystem,FIBK,$4.54 B,$43.53,$0.21 B,$0.96 B,106.526.000,2.358
6552,1392,https://companiesmarketcap.com/rapid7/marketcap/,NaN,Rapid7,RPD,$1.83 B,$31.00,-$0.15 B,$0.65 B,58.239.958,2.353
6553,1393,https://companiesmarketcap.com/secureworks/mar...,NaN,Secureworks,SCWX,$0.60 B,$7.08,-$89.23 M,$0.49 B,84.483.000,2.351
6554,1394,https://companiesmarketcap.com/helios-technolo...,NaN,Helios Technologies,HLIO,$1.72 B,$53.07,$0.14 B,$0.90 B,32.497.000,2.350
6555,1395,https://companiesmarketcap.com/accolade/market...,NaN,Accolade,ACCD,$0.64 B,$9.03,-$0.4 B,$0.35 B,70.475.778,2.350
6556,1396,https://companiesmarketcap.com/townsquare-medi...,NaN,Townsquare Media,TSQ,$0.12 B,$7.37,$70.45 M,$0.44 B,16.986.000,2.340
6557,1397,https://companiesmarketcap.com/netscout/market...,NaN,NETSCOUT,NTCT,$2.73 B,$37.80,$62.63 M,$0.89 B,72.452.000,2.308
6558,1398,https://companiesmarketcap.com/now/marketcap/,NaN,NOW Inc.,DNOW,$1.37 B,$12.49,$0.11 B,$2.02 B,111.000.000,2.300
6559,1399,https://companiesmarketcap.com/atn-internation...,NaN,ATN International,ATNI,$0.76 B,$48.53,-$13.66 M,$0.72 B,15.749.000,2.300

In [190]:
cmc3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6560 entries, 0 to 6559
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    6560 non-null   int64
 1   URL           6560 non-null   object
 2   ID            5151 non-null   float64
 3   Name          6551 non-null   object
 4   Company code  6550 non-null   object
 5   Marketcap     6534 non-null   object
 6   Share price   6547 non-null   object
 7   Earnings      6506 non-null   object
 8   Revenue       6268 non-null   object
 9   Shares        2262 non-null   object
 10  Employees     6157 non-null   object
dtypes: float64(1), int64(1), object(9)
memory usage: 563.9+ KB

In [191]:
cmc3.dtypes

Unnamed: 0        int64
URL              object
ID              float64
Name             object
Company code     object
Marketcap        object
Share price      object
Earnings         object
Revenue          object
Shares           object
Employees        object
dtype: object

In [192]:
cmc3.isnull().sum()

Unnamed: 0         0
URL                0
ID              1409
Name               9
Company code      10
Marketcap         26
Share price       13
Earnings          54
Revenue          292
Shares          4298
Employees        403
dtype: int64

In [193]:
cmc4 = pd.read_csv("de-sources-2022-2023/companiesmarketcap.com/wissel-categorie-companiesmarketcap.com.csv")
cmc4.tail(10)

      Company ID                 Category                 Hash
1813        1393                     Tech  5392941245537608590
1814        1394               ITsecurity  2028367090288460929
1815        1394                     Tech  5392941245537608590
1816        1394                 Software  6273975210915946900
1817        1396               Healthcare  1473658128705581606
1818        1397               MediaPress -6159643471181631199
1819        1399                   OilGas  7683904390150838630
1820        1399  OilGasEquipmentServices -5823085833726200737
1821        1399                   Energy -2882595272621617431
1822        1400        Telecommunication -3862064693147789081

In [194]:
cmc4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1823 entries, 0 to 1822
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Company ID  1823 non-null   int64
 1   Category    1823 non-null   object
 2   Hash        1823 non-null   int64
dtypes: int64(2), object(1)
memory usage: 42.9+ KB

In [195]:
cmc4.dtypes

Company ID     int64
Category      object
Hash           int64
dtype: object

In [196]:
cmc4.isnull().sum()

Company ID    0
Category      0
Hash          0
dtype: int64

#### Formato .json

In [197]:
cmc5 = pd.read_json('de-sources-2022-2023/companiesmarketcap.com/avengers-companiesMarketCap.json', lines=True)
cmc5.head()

,id,name,rank,market_cap,country,share_price,change_1_day,change_1_year,categories
0,1aeb78c70807445290795f145210a39e,Apple,1,$2.351 T,USA,$147.81,-0.34%,-9.74%,"[Tech, Software, Dow jones, Tech Hardware, Ele..."
1,8443bd488b2543718e4dab19e7d1b371,Bristol-myers Squibb,57,$172.49 B,USA,$81.13,0.31%,46.42%,"[Pharmaceuticals, Biotech]"
2,d35ff63680a645f986048ab48d2fe322,Wells Fargo,56,$175.05 B,USA,$45.94,-1.98%,-6.07%,"[Banks, Financial services]"
3,0664af11c7b9417bab58542ffa880c0e,Nike,55,$175.54 B,USA,$112.20,1.29%,-34.00%,"[Sports goods, Footwear, Dow jones, Clothing]"
4,4a67737ea89e450b8e8677a91e90327f,Walt Disney,54,$177.08 B,USA,$99.43,0.85%,-32.45%,"[Entertainment, Dow jones]"

In [198]:
cmc5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5897 entries, 0 to 5896
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             5897 non-null   object
 1   name           5897 non-null   object
 2   rank           5897 non-null   int64
 3   market_cap     5897 non-null   object
 4   country        5741 non-null   object
 5   share_price    5897 non-null   object
 6   change_1_day   5897 non-null   object
 7   change_1_year  5648 non-null   object
 8   categories     5019 non-null   object
dtypes: int64(1), object(8)
memory usage: 414.8+ KB

In [199]:
cmc5.dtypes

id               object
name             object
rank              int64
market_cap       object
country          object
share_price      object
change_1_day     object
change_1_year    object
categories       object
dtype: object

In [200]:
cmc5.isnull().sum()

id                 0
name               0
rank               0
market_cap         0
country          156
share_price        0
change_1_day       0
change_1_year    249
categories       878
dtype: int64

In [201]:
cmc6 = pd.read_json('de-sources-2022-2023/companiesmarketcap.com/GioPonSpiz-companiesmarketcap.json')
cmc6.head()

                name   codice  pricecap    price    country
0              Apple     AAPL  $2.143 T  $134.76        USA
1       Saudi Aramco  2222.SR  $1.878 T    $8.54  S. Arabia
2          Microsoft     MSFT  $1.783 T  $239.23        USA
3  Alphabet (Google)     GOOG  $1.195 T   $92.80        USA
4             Amazon     AMZN  $1.000 T   $98.12        USA

In [202]:
cmc6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7200 entries, 0 to 7199
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      7200 non-null   object
 1   codice    7200 non-null   object
 2   pricecap  7200 non-null   object
 3   price     7200 non-null   object
 4   country   7200 non-null   object
dtypes: object(5)
memory usage: 281.4+ KB

In [203]:
cmc6.dtypes

name        object
codice      object
pricecap    object
price       object
country     object
dtype: object

In [204]:
cmc6.isnull().sum()

name        0
codice      0
pricecap    0
price       0
country     0
dtype: int64

In [205]:
cmc7 = pd.read_json('de-sources-2022-2023/companiesmarketcap.com/gren-companiesmarketcap.com.json')
cmc7.head()

                name market_capitalization_USD price    country
0              Apple             2062000000000   130        USA
1       Saudi Aramco             1848000000000     8  S. Arabia
2          Microsoft             1676000000000   225        USA
3  Alphabet (Google)             1137000000000    88        USA
4             Amazon              878160000000    86        USA

In [206]:
cmc7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7163 entries, 0 to 7162
Data columns (total 4 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   name                       7163 non-null   object
 1   market_capitalization_USD  7163 non-null   object
 2   price                      7163 non-null   object
 3   country                    7163 non-null   object
dtypes: object(4)
memory usage: 224.0+ KB

In [207]:
cmc7.dtypes

name                         object
market_capitalization_USD    object
price                        object
country                      object
dtype: object

In [208]:
cmc7.isnull().sum()

name                         0
market_capitalization_USD    0
price                        0
country                      0
dtype: int64

In [209]:
cmc8 = pd.read_json('de-sources-2022-2023/companiesmarketcap.com/iGMM-companiesmarketcap.json')
cmc8.head()

,name,code,rank,marketcap,country,sharePrice,change(1day),change(1year),categories
0,Apple,AAPL,1,$2.242 T,USA,$140.94,-1.38%,-17.67%,"[Tech, Software, Dowjones, TechHardware, Elect..."
1,McDonald,MCD,46,$198.00 B,USA,$270.34,-0.53%,4.01%,"[Restaurantchains, Dowjones, Food]"
2,T-Mobile US,TMUS,51,$185.11 B,USA,$148.79,-0.40%,27.01%,[Telecommunication]
3,Toyota,TM,49,$195.66 B,Japan,$141.86,0.55%,-24.32%,"[Automakers, Manufacturing]"
4,Cisco,CSCO,47,$197.92 B,USA,$48.18,-0.84%,-17.05%,"[Tech, Electronics, Networkinghardware, Dowjon..."

In [210]:
cmc8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7093 entries, 0 to 7092
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           7093 non-null   object
 1   code           7093 non-null   object
 2   rank           7093 non-null   int64
 3   marketcap      7093 non-null   object
 4   country        7093 non-null   object
 5   sharePrice     7093 non-null   object
 6   change(1day)   7093 non-null   object
 7   change(1year)  6911 non-null   object
 8   categories     7093 non-null   object
dtypes: int64(1), object(8)
memory usage: 498.9+ KB

In [211]:
cmc8.dtypes

name             object
code             object
rank              int64
marketcap        object
country          object
sharePrice       object
change(1day)     object
change(1year)    object
categories       object
dtype: object

In [212]:
cmc8.isnull().sum()

name               0
code               0
rank               0
marketcap          0
country            0
sharePrice         0
change(1day)       0
change(1year)    182
categories         0
dtype: int64

#### Formato .xls

In [213]:
cmc9 = pd.read_excel('de-sources-2022-2023/companiesmarketcap.com/MalPatSaj-companiesmarketcap.com.xls')
cmc9.head()

   Unnamed: 0               Name   Symbol  MarketCap    Price    Country
0           0              Apple     AAPL   $2.278 T  $143.21        USA
1           1          Microsoft     MSFT   $1.917 T  $257.22        USA
2           2       Saudi Aramco  2222.SR   $1.810 T    $8.23  S. Arabia
3           3  Alphabet (Google)     GOOG   $1.232 T   $95.31        USA
4           4             Amazon     AMZN  $934.27 B   $91.58        USA

In [214]:
cmc9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  7000 non-null   int64
 1   Name        7000 non-null   object
 2   Symbol      6999 non-null   object
 3   MarketCap   7000 non-null   object
 4   Price       7000 non-null   object
 5   Country     6999 non-null   object
dtypes: int64(1), object(5)
memory usage: 328.2+ KB

In [215]:
cmc9.dtypes

Unnamed: 0     int64
Name          object
Symbol        object
MarketCap     object
Price         object
Country       object
dtype: object

In [216]:
cmc9.isnull().sum()

Unnamed: 0    0
Name          0
Symbol        1
MarketCap     0
Price         0
Country       1
dtype: int64

### **disfold.com**

#### Formato .csv

In [217]:
dis1 = pd.read_csv("de-sources-2022-2023/disfold.com/FR-disfold.csv")
dis1.tail(10)

,Founded,Top Competitor,Employees,CEO,Name
889,NaN,BlackRock,"Employees: 8,001",CEO: Mr. Johan Hjertonsson MBA,Investment AB Latour
890,NaN,Mitsui Fudosan Co. Ltd,"Employees: 9,982",CEO: Mr. Junichi Yoshida,Mitsubishi Estate Co. Ltd
891,NaN,Morgan Stanley,"Employees: 15,198",NaN,Guotai Junan Securities Co. Ltd
892,NaN,Linde,"Employees: 27,318",NaN,Nippon Paint Holdings Co. Ltd
893,Founded: 2012,Amazon,"Employees: 21,000",CEO: Mr. Ernest C. Garcia III,Carvana Co.
894,Founded: 1930,Chubb Limited,"Employees: 20,300",CEO: Mr. Thomas Sinnickson Gayner,Markel Corporation
895,Founded: 1939,"Marsh & McLennan Companies, Inc.","Employees: 12,023","CEO: Mr. J. Powell Brown C.P.C.U., CPCU","Brown & Brown, Inc."
896,NaN,Accenture,"Employees: 16,196",CEO: Mr. Shingo Konomoto,Nomura Research Institute Ltd
897,Founded: 1986,Las Vegas Sands Corp.,"Employees: 52,000",CEO: Mr. William Joseph Hornbuckle IV,MGM Resorts International
898,NaN,JPMorgan,"Employees: 9,594",NaN,Mega Financial Holding Co. Ltd

In [218]:
dis1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 899 entries, 0 to 898
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Founded         529 non-null    object
 1   Top Competitor  899 non-null    object
 2   Employees       860 non-null    object
 3   CEO             759 non-null    object
 4   Name            899 non-null    object
dtypes: object(5)
memory usage: 35.2+ KB

In [219]:
dis1.dtypes

Founded           object
Top Competitor    object
Employees         object
CEO               object
Name              object
dtype: object

In [220]:
dis1.isnull().sum()

Founded           370
Top Competitor      0
Employees          39
CEO               140
Name                0
dtype: int64

In [221]:
dis2 = pd.read_csv("de-sources-2022-2023/disfold.com/MarScoToc-Disfold.csv")
dis2.tail(10)

,Name,MasterCap,Country,Industry,Sector
950,Trinity Exploration & Production plc,$93.2 M,United Kingdom,Oil & Gas E&P,Energy
951,Braemar Shipping Services plc,$93.2 M,United Kingdom,Marine Shipping,Industrials
952,Arena Events Group plc,"(Jan. 1, 2022)",United Kingdom,Advertising Agencies,Communication Services
953,Geodrill Limited,$92.3 M,United Kingdom,Other Industrial Metals & Mining,Basic Materials
954,OnTheMarket plc,$91.8 M,United Kingdom,Internet Content & Information,Communication Services
955,Shoe Zone plc,$91.6 M,United Kingdom,Footwear & Accessories,Consumer Discretionary
956,Real Estate Investors plc,$91.5 M,United Kingdom,REIT�Diversified,Real Estate
957,Futura Medical plc,$91.5 M,United Kingdom,Biotechnology,Healthcare
958,Bespoke Capital Acquisition Corp.,"(April 5, 2021)",United Kingdom,Shell Companies,Financials
959,IG Design Group plc,$90.6 M,United Kingdom,Specialty Retail,Consumer Discretionary

In [222]:
dis2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 960 entries, 0 to 959
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       960 non-null    object
 1   MasterCap  960 non-null    object
 2   Country    960 non-null    object
 3   Industry   960 non-null    object
 4   Sector     960 non-null    object
dtypes: object(5)
memory usage: 37.6+ KB

In [223]:
dis2.dtypes

Name         object
MasterCap    object
Country      object
Industry     object
Sector       object
dtype: object

In [224]:
dis2.isnull().sum()

Name         0
MasterCap    0
Country      0
Industry     0
Sector       0
dtype: int64

In [225]:
dis3 = pd.read_csv("de-sources-2022-2023/disfold.com/silvestri-disfold.com.csv")
dis3.tail(10)

,name,country,market_value_apr_2022,sector,stock
990,"Quanta Services, Inc.",united states,$18.25 B,industrials,PWR
991,"Catalent, Inc.",united states,$18.24 B,healthcare,CTLT
992,Haitong Securities Co. Ltd,china,$18.23 B,financials,600837
993,Asahi Group Holdings Ltd,japan,$18.21 B,consumer staples,2502
994,Capitec Bank Holdings Ltd,south africa,$18.21 B,financials,CPI
995,Restaurant Brands International Inc.,canada,$18.19 B,consumer discretionary,QSR
996,"Yum China Holdings, Inc.",china,$18.18 B,consumer discretionary,YUMC
997,CEZ AS,NaN,NaN,NaN,CEZ
998,Veolia Environnement SA,france,$18.14 B,industrials,VIE
999,"Avis Budget Group, Inc.",united states,$18.12 B,industrials,CAR

In [226]:
dis3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   name                   1000 non-null   object
 1   country                985 non-null    object
 2   market_value_apr_2022  962 non-null    object
 3   sector                 985 non-null    object
 4   stock                  999 non-null    object
dtypes: object(5)
memory usage: 39.2+ KB

In [227]:
dis3.dtypes

name                     object
country                  object
market_value_apr_2022    object
sector                   object
stock                    object
dtype: object

In [228]:
dis3.isnull().sum()

name                      0
country                  15
market_value_apr_2022    38
sector                   15
stock                     1
dtype: int64

#### Formato .json

In [229]:
dis4 = pd.read_json('de-sources-2022-2023/disfold.com/avengers-disfold.json', lines=True)
dis4.head()

,id,name,official_name,headquarters_country,headquarters_continent,founded,employees,ceo,market_cap,categories,gbp
0,1e4dfb844d5a47e39c14699648cbd55a,Apple,Apple Inc.,Cupertino,CA,"April 1, 1976","100,000",Mr. Timothy D. Cook,$2.825 Trillion,"[UnitedStates, Technology, ConsumerElectronics...",NaN
1,031f69c6c7fd49d89b00ecdfcd294bad,Danaher,Danaher Corporation,Washington,DC,1969,"78,000",Mr. Rainer M. Blair,$208.03 Billion,"[UnitedStates, Healthcare, Diagnostics&Researc...",NaN
2,8acd1acfe59d4fc88c28038c9d3e8911,Merck,"Merck & Co., Inc.",Kenilworth,NJ,1891,"67,000",Mr. Robert M. Davis J.D.,$210.38 Billion,"[UnitedStates, Healthcare, DrugManufacturers—G...",NaN
3,ba6efa594766439dafb4045f0b25a23a,Bhp,BHP Group,Melbourne,VIC,1885,"40,110","Mr. Mike P. Henry B.Sc., BSc (Chem)",A$281.66 Billion,"[Australia, BasicMaterials, OtherIndustrialMet...",$211.25 Billion
4,83d47a2c8bd545cf80c17abfa6d81cf9,Nike,"Nike, Inc.",Beaverton,OR,"January 25, 1964","73,300",Mr. John J. Donahoe II,$213.60 Billion,"[UnitedStates, ConsumerDiscretionary, Footwear...",NaN

In [230]:
dis4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      1000 non-null   object
 1   name                    1000 non-null   object
 2   official_name           126 non-null    object
 3   headquarters_country    907 non-null    object
 4   headquarters_continent  907 non-null    object
 5   founded                 564 non-null    object
 6   employees               876 non-null    object
 7   ceo                     800 non-null    object
 8   market_cap              1000 non-null   object
 9   categories              1000 non-null   object
 10  gbp                     523 non-null    object
dtypes: object(11)
memory usage: 86.1+ KB

In [231]:
dis4.dtypes

id                        object
name                      object
official_name             object
headquarters_country      object
headquarters_continent    object
founded                   object
employees                 object
ceo                       object
market_cap                object
categories                object
gbp                       object
dtype: object

In [232]:
dis4.isnull().sum()

id                          0
name                        0
official_name             874
headquarters_country       93
headquarters_continent     93
founded                   436
employees                 124
ceo                       200
market_cap                  0
categories                  0
gbp                       477
dtype: int64

In [233]:
dis5 = pd.read_json('de-sources-2022-2023/disfold.com/DeBiGa-disfold.json')
dis5.head()

,name,market_cap,stock,country,sector,industry,headquarters,founded,employees,ceo
0,"Avis Budget Group, Inc.",$18.12 B,CAR,United States,Industrials,Rental & Leasing Services,"Parsippany,NJ,UnitedStates",2006,"16,000",Mr. Joseph A. Ferraro
1,Telefônica Brasil SA,$20.19 B,VIV,Brazil,Communication Services,Telecom Services,"SÃ£oPaulo,SP,Brazil",1998,"34,000",Mr. Christian Mauad Gebara
2,East Japan Railway Company,$22.78 B,9020,Japan,Industrials,Railroads,"Tokyo,Japan",,"71,973",Mr. Yuji Fukasawa
3,Twilio Inc.,$26.09 B,TWLO,United States,Communication Services,Internet Content & Information,"SanFrancisco,CA,UnitedStates",2008,"7,867",Mr. Jeffrey Lawson
4,"Delta Electronics, Inc.",$24.05 B,2308,Taiwan,Technology,Electronic Components,"Taipei,Taiwan",,,Mr. Ping Cheng

In [234]:
dis5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          1000 non-null   object
 1   market_cap    1000 non-null   object
 2   stock         1000 non-null   object
 3   country       1000 non-null   object
 4   sector        1000 non-null   object
 5   industry      1000 non-null   object
 6   headquarters  1000 non-null   object
 7   founded       1000 non-null   object
 8   employees     1000 non-null   object
 9   ceo           1000 non-null   object
dtypes: object(10)
memory usage: 78.2+ KB

In [235]:
dis5.dtypes

name            object
market_cap      object
stock           object
country         object
sector          object
industry        object
headquarters    object
founded         object
employees       object
ceo             object
dtype: object

In [236]:
dis5.isnull().sum()

name            0
market_cap      0
stock           0
country         0
sector          0
industry        0
headquarters    0
founded         0
employees       0
ceo             0
dtype: int64

In [237]:
dis6 = pd.read_json('de-sources-2022-2023/disfold.com/GioPonSpiz-disfold.json')
dis6.head()

,name,marketCap,stock,sector,industry,country
0,Apple Inc.,$2.825 T,AAPL,Technology,Consumer Electronics,United States
1,Microsoft Corporation,$2.328 T,MSFT,Technology,Software—Infrastructure,United States
2,Saudi Arabian Oil Company,$2.297 T,2222,Energy,Oil & Gas Integrated,Saudi Arabia
3,Alphabet Inc.,$1.825 T,GOOG,Communication Services,Internet Content & Information,United States
4,"Amazon.com, Inc.",$1.642 T,AMZN,Consumer Discretionary,Internet Retail,United States

In [238]:
dis6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       1000 non-null   object
 1   marketCap  1000 non-null   object
 2   stock      1000 non-null   object
 3   sector     1000 non-null   object
 4   industry   1000 non-null   object
 5   country    1000 non-null   object
dtypes: object(6)
memory usage: 47.0+ KB

In [239]:
dis6.dtypes

name         object
marketCap    object
stock        object
sector       object
industry     object
country      object
dtype: object

In [240]:
dis6.isnull().sum()

name         0
marketCap    0
stock        0
sector       0
industry     0
country      0
dtype: int64

In [241]:
dis7 = pd.read_json('de-sources-2022-2023/disfold.com/iGMM-disfold.json')
dis7.head()

,name,code,rank,ceo,country,sector,industry,headquarters,employees,founded,marketcap,revenue,net income,link
0,Apple,AAPL,1,Mr. Timothy D. Cook,United States,Technology,Consumer Electronics,"Cupertino, CA, United States","100,000","April 1, 1976",$2.825 Trillion,US$365.82 billion (2021),US$94.68 billion (2021),"[https://www.apple.com, https://www.facebook.c..."
1,ExxonMobil,XOM,23,Mr. Darren W. Woods,United States,Energy,Oil & Gas Integrated,"Irving, TX, United States","63,000","November 30, 1999",$348.72 Billion,US$276.692 billion (2021),US$23.040 billion (2021),"[https://corporate.exxonmobil.com, https://en...."
2,Roche,ROG,22,Dr. Severin Schwan Ph.D.,Switzerland,Healthcare,Drug Manufacturers—General,"Basel, Switzerland","100,920",None,US$349.50 Billion,None,None,[https://www.roche.com]
3,Home Depot,HD,25,Mr. Edward P. Decker,United States,Consumer Discretionary,Home Improvement Retail,"Atlanta, GA, United States","490,600","February 6, 1978",$321.47 Billion,US$110.2 billion (2019),US$11.24 billion (2019),"[https://www.homedepot.com, https://en.wikiped..."
4,Pfizer,PFE,27,"Dr. Albert Bourla D.V.M., DVM, Ph.D.",United States,Healthcare,Drug Manufacturers—General,"New York, NY, United States","79,000",1849,$300.79 Billion,$41.908 billion (2020),$9.616 billion (2020),"[https://www.pfizer.com, https://www.facebook...."

In [242]:
dis7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          1000 non-null   object
 1   code          1000 non-null   object
 2   rank          1000 non-null   object
 3   ceo           835 non-null    object
 4   country       1000 non-null   object
 5   sector        1000 non-null   object
 6   industry      1000 non-null   object
 7   headquarters  995 non-null    object
 8   employees     958 non-null    object
 9   founded       579 non-null    object
 10  marketcap     1000 non-null   object
 11  revenue       564 non-null    object
 12  net income    525 non-null    object
 13  link          1000 non-null   object
dtypes: object(14)
memory usage: 109.5+ KB

In [243]:
dis7.dtypes

name            object
code            object
rank            object
ceo             object
country         object
sector          object
industry        object
headquarters    object
employees       object
founded         object
marketcap       object
revenue         object
net income      object
link            object
dtype: object

In [244]:
dis7.isnull().sum()

name              0
code              0
rank              0
ceo             165
country           0
sector            0
industry          0
headquarters      5
employees        42
founded         421
marketcap         0
revenue         436
net income      475
link              0
dtype: int64

In [245]:
dis8 = pd.read_json('de-sources-2022-2023/disfold.com/gren-disfold.com.json')
dis8.head()

,name,market_capitalization_USD,stock,country,sector,industry
0,Apple Inc.,2825000000000,AAPL,United States,Technology,Consumer Electronics
1,Microsoft Corporation,2328000000000,MSFT,United States,Technology,Software—Infrastructure
2,Saudi Arabian Oil Company,2297000000000,2222,Saudi Arabia,Energy,Oil & Gas Integrated
3,Alphabet Inc.,1825000000000,GOOG,United States,Communication Services,Internet Content & Information
4,"Amazon.com, Inc.",1642000000000,AMZN,United States,Consumer Discretionary,Internet Retail

In [246]:
dis8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   name                       1000 non-null   object
 1   market_capitalization_USD  1000 non-null   int64
 2   stock                      1000 non-null   object
 3   country                    1000 non-null   object
 4   sector                     1000 non-null   object
 5   industry                   1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.0+ KB

In [247]:
dis8.dtypes

name                         object
market_capitalization_USD     int64
stock                        object
country                      object
sector                       object
industry                     object
dtype: object

In [248]:
dis8.isnull().sum()

name                         0
market_capitalization_USD    0
stock                        0
country                      0
sector                       0
industry                     0
dtype: int64

In [249]:
dis9 = pd.read_json('de-sources-2022-2023/disfold.com/slytherin-disfold.com.json')
dis9.head()

,link,name,headquarters,employees,ceo,market_cap
0,https://disfold.com/company/great-wall-motor-c...,Great Wall Motor Co Ltd,"Baoding, China","63,174",Not found,CN¥203.69 Billion
1,https://disfold.com/company/colbun-sa/,Colbún SA,"Santiago, Chile","1,193",Mr. Thomas Lippold Keller,CL$1.098 Trillion
2,https://disfold.com/company/usinas-siderurgica...,Usinas Siderúrgicas de Minas Gerais SA,"Belo Horizonte, Brazil",Not found,Mr. Sergio Leite de Andrade,€3.54 Billion
3,https://disfold.com/company/origin-enterprises...,Origin Enterprises plc,"Dublin, Ireland","2,641",Mr. Sean Gerard Coyle,€539.3 Million
4,https://disfold.com/company/summit-real-estate...,Summit Real Estate Holdings Ltd,"Haifa, Israel",144,Mr. Amir Sagi,₪45.1 Million

In [250]:
dis9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16097 entries, 0 to 16096
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   link          16097 non-null  object
 1   name          16097 non-null  object
 2   headquarters  16097 non-null  object
 3   employees     16097 non-null  object
 4   ceo           16097 non-null  object
 5   market_cap    16097 non-null  object
dtypes: object(6)
memory usage: 754.7+ KB

In [251]:
dis9.dtypes

link            object
name            object
headquarters    object
employees       object
ceo             object
market_cap      object
dtype: object

In [252]:
dis9.isnull().sum()

link            0
name            0
headquarters    0
employees       0
ceo             0
market_cap      0
dtype: int64

### Formato .xlsx

In [253]:
dis10 = pd.read_excel('de-sources-2022-2023/disfold.com/MalPatSaj-disfold.com.xlsx')
dis10.head()

c:\Users\giord\anaconda3\lib\site-packages\openpyxl\worksheet\header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

,Unnamed: 0,Name,MarketCap,Stock,Country,Sector,Industry
0,0,Apple Inc.,$2.825 T,AAPL,United States,Technology,Consumer Electronics
1,1,Microsoft Corporation,$2.328 T,MSFT,United States,Technology,Software—Infrastructure
2,2,Saudi Arabian Oil Company,$2.297 T,2222,Saudi Arabia,Energy,Oil & Gas Integrated
3,3,Alphabet Inc.,$1.825 T,GOOG,United States,Communication Services,Internet Content & Information
4,4,"Amazon.com, Inc.",$1.642 T,AMZN,United States,Consumer Discretionary,Internet Retail

In [254]:
dis10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1000 non-null   int64
 1   Name        1000 non-null   object
 2   MarketCap   1000 non-null   object
 3   Stock       999 non-null    object
 4   Country     1000 non-null   object
 5   Sector      1000 non-null   object
 6   Industry    1000 non-null   object
dtypes: int64(1), object(6)
memory usage: 54.8+ KB

In [255]:
dis10.dtypes

Unnamed: 0     int64
Name          object
MarketCap     object
Stock         object
Country       object
Sector        object
Industry      object
dtype: object

In [256]:
dis10.isnull().sum()

Unnamed: 0    0
Name          0
MarketCap     0
Stock         1
Country       0
Sector        0
Industry      0
dtype: int64

### **forbes.com**

#### Formato .csv

In [257]:
for1 = pd.read_csv("de-sources-2022-2023/forbes.com/FR-forbes.csv")
for1.tail(5)

,Industry,Founded,Revenue,Name,Location
1433,Chemicals,1892.0,$8.9B,Olin,"Clayton, Missouri"
1434,Diversified Financials,1973.0,$1.4B,Kimco Realty,"Jericho, New York"
1435,Banking,1996.0,$3.9B,Bank of Chongqing,"Chongqing, China"
1436,Technology Hardware & Equipment,2000.0,$3.3B,Fortinet,"Sunnyvale, California"
1437,Household & Personal Products,1846.0,$5.2B,Church & Dwight,"Ewing, New Jersey"

In [258]:
for1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1438 entries, 0 to 1437
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Industry  1438 non-null   object
 1   Founded   1396 non-null   float64
 2   Revenue   1438 non-null   object
 3   Name      1438 non-null   object
 4   Location  1438 non-null   object
dtypes: float64(1), object(4)
memory usage: 56.3+ KB

In [259]:
for1.dtypes

Industry     object
Founded     float64
Revenue      object
Name         object
Location     object
dtype: object

In [260]:
for1.isnull().sum()

Industry     0
Founded     42
Revenue      0
Name         0
Location     0
dtype: int64

In [261]:
for2 = pd.read_csv("de-sources-2022-2023/forbes.com/silvestri-forbes.com.csv")
for2.tail(5)

           country market_value_apr_2022                 name revenue_2022
995        ireland              $12.59 B      aercap holdings      $4.52 B
996  united states              $12.21 B        first horizon      $3.15 B
997          japan              $10.34 B               dentsu      $9.88 B
998  united states              $19.08 B    molina healthcare     $27.77 B
999          india               $3.62 B  union bank of india     $11.28 B

In [262]:
for2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   country                1000 non-null   object
 1   market_value_apr_2022  1000 non-null   object
 2   name                   1000 non-null   object
 3   revenue_2022           1000 non-null   object
dtypes: object(4)
memory usage: 31.4+ KB

In [263]:
for2.dtypes

country                  object
market_value_apr_2022    object
name                     object
revenue_2022             object
dtype: object

In [264]:
for2.isnull().sum()

country                  0
market_value_apr_2022    0
name                     0
revenue_2022             0
dtype: int64

#### Formato .json

In [265]:
for3 = pd.read_json('de-sources-2022-2023/forbes.com/slytherin-forbes.com.json')
for3.head()

,link,name,industry,founded,country,ceo,employees,revenue
0,https://www.forbes.com/companies/berkshire-hat...,Berkshire Hathaway,Diversified Financials,1939,United States,Warren Edward Buffett,"372,000",$276.1B
1,https://www.forbes.com/companies/icbc,ICBC,Banking,1984,China,Shu Gu,"434,089",$208.1B
2,https://www.forbes.com/companies/saudi-arabian...,Saudi Arabian Oil Company (Saudi Aramco),Oil & Gas Operations,1933,Saudi Arabia,Amin bin Hasan Al-Nasser,"68,493",$400.4B
3,https://www.forbes.com/companies/jpmorgan-chase,JPMorgan Chase,Banking and Financial Services,2000,United States,Jamie Dimon,"270,000",$124.5B
4,https://www.forbes.com/companies/china-constru...,China Construction Bank,Banking,2014,China,Wang Zuji,"349,671",$202.1B

In [266]:
for3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   link       2000 non-null   object
 1   name       2000 non-null   object
 2   industry   2000 non-null   object
 3   founded    2000 non-null   object
 4   country    2000 non-null   object
 5   ceo        2000 non-null   object
 6   employees  2000 non-null   object
 7   revenue    2000 non-null   object
dtypes: object(8)
memory usage: 125.1+ KB

In [267]:
for3.dtypes

link         object
name         object
industry     object
founded      object
country      object
ceo          object
employees    object
revenue      object
dtype: object

In [268]:
for3.isnull().sum()

link         0
name         0
industry     0
founded      0
country      0
ceo          0
employees    0
revenue      0
dtype: int64

#### Formato .xls

In [269]:
for4 = pd.read_excel('de-sources-2022-2023/forbes.com/MalPatSaj-forbes.com.xls')
for4.head()

,Unnamed: 0,Name,Country,Sales,Profit,Assets,Market Value
0,0,Berkshire Hathaway,United States,$276.09 B,$89.8 B,$958.78 B,$741.48 B
1,1,ICBC,China,$208.13 B,$54.03 B,"$5,518.51 B",$214.43 B
2,2,Saudi Arabian Oil Company (Saudi Aramco),Saudi Arabia,$400.38 B,$105.36 B,$576.04 B,"$2,292.08 B"
3,3,JPMorgan Chase,United States,$124.54 B,$42.12 B,"$3,954.69 B",$374.45 B
4,4,China Construction Bank,China,$202.07 B,$46.89 B,"$4,746.95 B",$181.32 B

In [270]:
for4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    2000 non-null   int64
 1   Name          2000 non-null   object
 2   Country       2000 non-null   object
 3   Sales         2000 non-null   object
 4   Profit        2000 non-null   object
 5   Assets        2000 non-null   object
 6   Market Value  2000 non-null   object
dtypes: int64(1), object(6)
memory usage: 109.5+ KB

In [271]:
for4.dtypes

Unnamed: 0       int64
Name            object
Country         object
Sales           object
Profit          object
Assets          object
Market Value    object
dtype: object

In [272]:
for4.isnull().sum()

Unnamed: 0      0
Name            0
Country         0
Sales           0
Profit          0
Assets          0
Market Value    0
dtype: int64

### **ft.com**

#### Formato .csv

In [273]:
ft1 = pd.read_csv("de-sources-2022-2023/ft.com/DDD-ft.com.csv")
ft1.tail(5)

,Unnamed: 0,name,country,sector,absolute_growth_rate_pct,compound_annual_growth_rate_cagr_pct,revenue_2020_euro,revenue_2017_euro,number_of_employees_2020,number_of_employees_2017,founding_year
995,995,peopleForecast,Germany,Technology,154.86,36.59,"2,086,411","818,658",45,15,2014
996,996,Digitalpa,Italy,Management Consulting,154.82,36.59,"1,731,340","679,440",12,41,2014
997,997,Faktenkontor,Germany,Advertising,154.81,36.59,"30,967,000","12,153,143",150,100,2003
998,998,CLAREO,France,Retail,154.80,36.58,"18,854,708","7,399,729",53,13,2012
999,999,Laca Trade,Italy,Property,154.60,36.55,"24,741,510","9,717,860",5,5,2013

In [274]:
ft1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   Unnamed: 0                            1000 non-null   int64
 1   name                                  1000 non-null   object
 2   country                               1000 non-null   object
 3   sector                                1000 non-null   object
 4   absolute_growth_rate_pct              1000 non-null   object
 5   compound_annual_growth_rate_cagr_pct  1000 non-null   float64
 6   revenue_2020_euro                     1000 non-null   object
 7   revenue_2017_euro                     1000 non-null   object
 8   number_of_employees_2020              1000 non-null   object
 9   number_of_employees_2017              1000 non-null   object
 10  founding_year                         1000 non-null   int64
dtypes: float64(1), int64(2), object(8)
memory usage: 86.1+ KB

In [275]:
ft1.dtypes

Unnamed: 0                                int64
name                                     object
country                                  object
sector                                   object
absolute_growth_rate_pct                 object
compound_annual_growth_rate_cagr_pct    float64
revenue_2020_euro                        object
revenue_2017_euro                        object
number_of_employees_2020                 object
number_of_employees_2017                 object
founding_year                             int64
dtype: object

In [276]:
ft1.isnull().sum()

Unnamed: 0                              0
name                                    0
country                                 0
sector                                  0
absolute_growth_rate_pct                0
compound_annual_growth_rate_cagr_pct    0
revenue_2020_euro                       0
revenue_2017_euro                       0
number_of_employees_2020                0
number_of_employees_2017                0
founding_year                           0
dtype: int64

In [277]:
ft2 = pd.read_csv("de-sources-2022-2023/ft.com/silvestri-ft.com.csv")
ft2.tail(5)

,country,employees_2017,employees_2020,founding_year,name,revenue_2017,revenue_2020,sector
995,germany,15,45.0,2014,peopleforecast,"818,658","2,086,411",technology
996,italy,41,12.0,2014,digitalpa,"679,440","1,731,340",management consulting
997,germany,100,150.0,2003,faktenkontor,"12,153,143","30,967,000",advertising
998,france,13,53.0,2012,clareo,"7,399,729","18,854,708",retail
999,italy,5,5.0,2013,laca trade,"9,717,860","24,741,510",property

In [278]:
ft2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country         1000 non-null   object
 1   employees_2017  997 non-null    object
 2   employees_2020  996 non-null    float64
 3   founding_year   1000 non-null   int64
 4   name            1000 non-null   object
 5   revenue_2017    1000 non-null   object
 6   revenue_2020    1000 non-null   object
 7   sector          1000 non-null   object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [279]:
ft2.dtypes

country            object
employees_2017     object
employees_2020    float64
founding_year       int64
name               object
revenue_2017       object
revenue_2020       object
sector             object
dtype: object

In [280]:
ft2.isnull().sum()

country           0
employees_2017    3
employees_2020    4
founding_year     0
name              0
revenue_2017      0
revenue_2020      0
sector            0
dtype: int64

In [281]:
ft3 = pd.read_csv("de-sources-2022-2023/ft.com/FR-ft.csv")
ft3.tail(5)

,Rank,Name,in 2021 ranking,in 2020 ranking,Country,Sector,Absolute Growth Rate %,Compound Annual Growth Rate (CAGR) %,Revenue 2020 (€),Revenue 2017 (€),Number of employees 2020,Number of employees 2017,Founding Year
995,996,peopleForecast,No,No,Germany,Technology,154.86,36.59,"2,086,411","818,658",45.0,15,2014
996,997,Digitalpa,No,No,Italy,Management Consulting,154.82,36.59,"1,731,340","679,440",12.0,41,2014
997,998,Faktenkontor,No,No,Germany,Advertising,154.81,36.59,"30,967,000","12,153,143",150.0,100,2003
998,999,CLAREO,Yes,Yes,France,Retail,154.80,36.58,"18,854,708","7,399,729",53.0,13,2012
999,1000,Laca Trade,Yes,Yes,Italy,Property,154.60,36.55,"24,741,510","9,717,860",5.0,5,2013

In [282]:
ft3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   Rank                                  1000 non-null   int64
 1   Name                                  1000 non-null   object
 2   in 2021 ranking                       1000 non-null   object
 3   in 2020 ranking                       1000 non-null   object
 4   Country                               1000 non-null   object
 5   Sector                                1000 non-null   object
 6   Absolute Growth Rate %                1000 non-null   object
 7   Compound Annual Growth Rate (CAGR) %  1000 non-null   float64
 8   Revenue 2020 (€)                      1000 non-null   object
 9   Revenue 2017 (€)                      1000 non-null   object
 10  Number of employees 2020              996 non-null    float64
 11  Number of employees 2017              997 non-null    object
 12  Founding Year                         1000 non-null   int64
dtypes: float64(2), int64(2), object(9)
memory usage: 101.7+ KB

In [283]:
ft3.dtypes

Rank                                      int64
Name                                     object
in 2021 ranking                          object
in 2020 ranking                          object
Country                                  object
Sector                                   object
Absolute Growth Rate %                   object
Compound Annual Growth Rate (CAGR) %    float64
Revenue 2020 (€)                         object
Revenue 2017 (€)                         object
Number of employees 2020                float64
Number of employees 2017                 object
Founding Year                             int64
dtype: object

In [284]:
ft3.isnull().sum()

Rank                                    0
Name                                    0
in 2021 ranking                         0
in 2020 ranking                         0
Country                                 0
Sector                                  0
Absolute Growth Rate %                  0
Compound Annual Growth Rate (CAGR) %    0
Revenue 2020 (€)                        0
Revenue 2017 (€)                        0
Number of employees 2020                4
Number of employees 2017                3
Founding Year                           0
dtype: int64

#### Formato .json

In [285]:
ft4 = pd.read_json('de-sources-2022-2023/ft.com/slytherin-ft.com.json')
ft4.head()

,link,name,country,industry,revenue,employees,founded
0,https://www.greatdealscorp.com/,Great Deals E-Commerce Corp.,Philippines,Ecommerce,88.77,385,2017
1,http://www.pclchip.com/,PCL Inc.,South Korea,Pharmaceuticals,45.48,63,2008
2,https://www.spolive.com/,Spolive,South Korea,Games industry,9.49,47,2013
3,https://www.workmate.asia/,Workmate,Singapore,Support Services,12.44,82,2015
4,http://www.taimedbiologics.com/,TaiMed Biologics,Taiwan,Pharmaceuticals,24.42,78,2007

In [286]:
ft4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   link       5000 non-null   object
 1   name       5000 non-null   object
 2   country    5000 non-null   object
 3   industry   5000 non-null   object
 4   revenue    5000 non-null   object
 5   employees  5000 non-null   object
 6   founded    5000 non-null   int64
dtypes: int64(1), object(6)
memory usage: 273.6+ KB

In [287]:
ft4.dtypes

link         object
name         object
country      object
industry     object
revenue      object
employees    object
founded       int64
dtype: object

In [288]:
ft4.isnull().sum()

link         0
name         0
country      0
industry     0
revenue      0
employees    0
founded      0
dtype: int64

In [289]:
ft5 = pd.read_json('de-sources-2022-2023/ft.com/gren-ft.com.json')
ft5.head()

,name,country,sector,revenue_2020_EU,revenue_2017_EU,employees_number_2020,employees_number_2017,founding_year
0,Swappie,Finland,Technology,97611814,507000,218,1,2016
1,Kilo Health,Lithuania,Health,57318766,344428,177,10,2013
2,OCI,UK,Financial Services,568322073,4325512,32,4,2012
3,OnlyFans,UK,Technology,316732986,2652185,800,4,2016
4,Enpal,Germany,Energy,56109613,486165,365,9,2017

In [290]:
ft5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   name                   1000 non-null   object
 1   country                1000 non-null   object
 2   sector                 1000 non-null   object
 3   revenue_2020_EU        1000 non-null   int64
 4   revenue_2017_EU        1000 non-null   int64
 5   employees_number_2020  1000 non-null   object
 6   employees_number_2017  1000 non-null   object
 7   founding_year          1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [291]:
ft5.dtypes

name                     object
country                  object
sector                   object
revenue_2020_EU           int64
revenue_2017_EU           int64
employees_number_2020    object
employees_number_2017    object
founding_year             int64
dtype: object

In [292]:
ft5.isnull().sum()

name                     0
country                  0
sector                   0
revenue_2020_EU          0
revenue_2017_EU          0
employees_number_2020    0
employees_number_2017    0
founding_year            0
dtype: int64

### **value.today**

#### Formato .csv

In [293]:
val1 = pd.read_csv("de-sources-2022-2023/value.today/silvestri-value.today.csv")
val1.tail(10)

,ceo,country,market_value_jan_2020,market_value_jan_2021,market_value_jan_2022,name,employees_2022,revenue_2022,sector
990,NaN,spain,3.015 Billion USD,2.548 Billion USD,2.653 Billion USD,compania de distribucion integral logista hold...,NaN,"11,930 Million USD",industries
991,NaN,france,1.847 Billion USD,1.958 Billion USD,2.648 Billion USD,constellium se,NaN,"6,150 Million USD",basic materials
992,NaN,switzerland,0.980 Billion USD,1.723 Billion USD,2.647 Billion USD,comet holding ag,NaN,549 Million USD,technology
993,NaN,denmark,0.867 Billion USD,1.785 Billion USD,2.638 Billion USD,bavarian nordic a/s,NaN,255 Million USD,healthcare
994,NaN,germany,NaN,NaN,2.631 Billion USD,encavis ag,NaN,332 Million USD,utilities
995,NaN,uk,1.945 Billion USD,2.027 Billion USD,2.620 Billion USD,domino's pizza group,NaN,743 Million USD,consumer cyclical
996,NaN,germany,7.101 Billion USD,10.737 Billion USD,2.617 Billion USD,teamviewer ag,"1,200",553 Million USD,technology
997,NaN,germany,1.464 Billion USD,2.013 Billion USD,2.610 Billion USD,gag immobilien ag,NaN,390 Million USD,real estate
998,NaN,france,2.794 Billion USD,2.387 Billion USD,2.600 Billion USD,nexity sa,NaN,"4,467 Million USD",real estate
999,NaN,sweden,1.851 Billion USD,2.225 Billion USD,2.598 Billion USD,fastpartner ab (publ),NaN,175 Million USD,real estate

In [294]:
val1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ceo                    303 non-null    object
 1   country                1000 non-null   object
 2   market_value_jan_2020  911 non-null    object
 3   market_value_jan_2021  943 non-null    object
 4   market_value_jan_2022  1000 non-null   object
 5   name                   1000 non-null   object
 6   employees_2022         719 non-null    object
 7   revenue_2022           983 non-null    object
 8   sector                 999 non-null    object
dtypes: object(9)
memory usage: 70.4+ KB

In [295]:
val1.dtypes

ceo                      object
country                  object
market_value_jan_2020    object
market_value_jan_2021    object
market_value_jan_2022    object
name                     object
employees_2022           object
revenue_2022             object
sector                   object
dtype: object

In [296]:
val1.isnull().sum()

ceo                      697
country                    0
market_value_jan_2020     89
market_value_jan_2021     57
market_value_jan_2022      0
name                       0
employees_2022           281
revenue_2022              17
sector                     1
dtype: int64

In [297]:
val2 = pd.read_csv("de-sources-2022-2023/value.today/FR-valuetoday.csv")
val2.tail(10)

,IPO Year,Number of Employees,Country,CEO,Founded Year,Market Value,Name
990,2016.0,"8,961",Canada,Ashutosh Raghuvanshi,1987.0,22.01 Billion USD,FORTIS
991,NaN,"9,230",China,NaN,1991.0,22.00 Billion USD,CHINA MERCHANTS SECURITIES
992,NaN,"236,386",Germany,NaN,1871.0,21.98 Billion USD,CONTINENTAL AG
993,NaN,"20,000",Russia,Pavel Sergeevich Grachev,1921.0,21.98 Billion USD,PJSC POLYUS
994,NaN,"39,035",Japan,Masahiko Uotani,1872.0,21.97 Billion USD,SHISEIDO COMPANY
995,NaN,"18,000",Norway,Sigve Brekke,1855.0,21.97 Billion USD,TELENOR ASA
996,NaN,355,UK,NaN,1920.0,21.95 Billion USD,SEGRO
997,NaN,"18,515",Spain,Ignacio Madridejos Fernandez,1952.0,21.93 Billion USD,FERROVIAL
998,NaN,"6,527",Denmark,Ester Baiget,2000.0,21.91 Billion USD,NOVOZYMES A/S
999,NaN,"33,342",Brazil,Harry Schmelzer Jr.,1961.0,21.89 Billion USD,WEG

In [298]:
val2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   IPO Year             175 non-null    float64
 1   Number of Employees  973 non-null    object
 2   Country              1000 non-null   object
 3   CEO                  842 non-null    object
 4   Founded Year         977 non-null    float64
 5   Market Value         968 non-null    object
 6   Name                 1000 non-null   object
dtypes: float64(2), object(5)
memory usage: 54.8+ KB

In [299]:
val2.dtypes

IPO Year               float64
Number of Employees     object
Country                 object
CEO                     object
Founded Year           float64
Market Value            object
Name                    object
dtype: object

In [300]:
val2.isnull().sum()

IPO Year               825
Number of Employees     27
Country                  0
CEO                    158
Founded Year            23
Market Value            32
Name                     0
dtype: int64

#### Formato .json

In [301]:
val3 = pd.read_json('de-sources-2022-2023/value.today/gren-value.today.json')
val3.head()

,name,annual_revenue_USD,annual_net_income_USD,market_capitalization_2022,employees_number,CEO,headquarters_country,wikipedia_page_url,twitter_page_url,facebook_page_url
0,APPLE,394330000000,99803000000,2825000000000,154000,Tim Cook,USA,https://en.wikipedia.org/wiki/Apple_Inc.,https://twitter.com/apple?lang=en,https://www.facebook.com/apple/
1,MICROSOFT CORPORATION,198270000000,72738000000,2358000000000,220000,Satya Nadella,USA,https://en.wikipedia.org/wiki/Microsoft,https://twitter.com/Microsoft,https://www.facebook.com/Microsoft/
2,SAUDI ARABIAN OIL COMPANY (Saudi Aramco),400460000000,105380000000,1889600000000,79800,Amin H. Al-Nasser,Saudi Arabia,https://en.wikipedia.org/wiki/Saudi_Aramco,https://twitter.com/Saudi_Aramco,https://www.facebook.com/aramco/
3,ALPHABET,257640000000,76003000000,1820000000000,156500,Sundar Pichai,USA,https://en.wikipedia.org/wiki/Alphabet_Inc.,https://twitter.com/google?lang=en,https://www.facebook.com/alphabet/
4,AMAZON.COM,469820000000,33364000000,1649000000000,1335000,Andy Jassy,USA,https://en.wikipedia.org/wiki/Amazon_(company),https://twitter.com/amazon,https://www.facebook.com/Amazon/

In [302]:
val3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10682 entries, 0 to 10681
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   name                        10682 non-null  object
 1   annual_revenue_USD          10682 non-null  object
 2   annual_net_income_USD       10682 non-null  object
 3   market_capitalization_2022  10682 non-null  object
 4   employees_number            10682 non-null  object
 5   CEO                         10682 non-null  object
 6   headquarters_country        10682 non-null  object
 7   wikipedia_page_url          10682 non-null  object
 8   twitter_page_url            10682 non-null  object
 9   facebook_page_url           10682 non-null  object
dtypes: object(10)
memory usage: 834.7+ KB

In [303]:
val3.dtypes

name                          object
annual_revenue_USD            object
annual_net_income_USD         object
market_capitalization_2022    object
employees_number              object
CEO                           object
headquarters_country          object
wikipedia_page_url            object
twitter_page_url              object
facebook_page_url             object
dtype: object

In [304]:
val3.isnull().sum()

name                          0
annual_revenue_USD            0
annual_net_income_USD         0
market_capitalization_2022    0
employees_number              0
CEO                           0
headquarters_country          0
wikipedia_page_url            0
twitter_page_url              0
facebook_page_url             0
dtype: int64

In [305]:
val4 = pd.read_json('de-sources-2022-2023/value.today/avengers-valuetoday.json', lines=True)
val4.head()

,id,name,world_rank,annual_revenue_in_usd,annual_net_income_in_usd,annual_results_for_year_ending,total_assets_in_usd,total_liabilities_in_usd,total_equity_in_usd,headquarters_region_city,headquarters_country,headquarters_sub_region,headquarters_continent,company_business,number_of_employees,ceo,founders,company_website
0,b9a098214d1a4ce1acc834cf17aef660,Apple,1,"394,330 Million USD","99,803 Million USD",Sep-2022,"352,760 Million USD","302,080 Million USD","50,672 Million USD",California,USA,Northern America,Americas,"[Technology, Mobiles & Accessories, Electronic...","154,000",Tim Cook,"[Steve Jobs, Steve Wozniak, Ronald Wayne]",https://www.apple.com/
1,42f1b7d5a40343de9837fc75d74767c3,Taiwan Semiconductor Manufacturing Company (tsmc),10,"55,306 Million USD","20,783 Million USD",Dec-2021,"129,800 Million USD","54,253 Million USD","75,543 Million USD",Hsinchu,Taiwan,South East Asia,Asia,"[Technology, Semiconductors, Electronics, Tech...","65,152",C. C. Wei,Morris Chang,https://www.tsmc.com/
2,85fa8c7dfbb447d898002cb3cfb2fffd,Nvidia Corporation,9,"26,914 Million USD","9,752 Million USD",For Year Ending JAN-2022,"44,187 Million USD","17,575 Million USD","26,612 Million USD",California,USA,Northern America,Americas,"[Technology, Semiconductors, Electronics, Tech...","18,975",Jensen Huang,"[Jensen Huang, Chris Malachowsky, Curtis Priem]",http://www.nvidia.com/
3,6b52bb9b50924235b1003c74bb8db227,Berkshire Hathaway,8,"354,640 Million USD","89,795 Million USD",For Year ending Dec-2021,"956,780 Million USD","443,850 Million USD","514,930 Million USD",Nebraska,USA,Northern America,Americas,"[Financial Services, Investments, Insurance]","372,000",Warren Buffett,Oliver Chace,https://www.berkshirehathaway.com/
4,d10c3bd4fe924f138454b6f0583de7a1,Meta Platforms,7,"117,930 Million USD","39,370 Million USD",Dec-2021,"165,990 Million USD","41,108 Million USD","124,880 Million USD",California,USA,Northern America,Americas,"[Communication Services, Internet or Mobile Ap...","77,805",Mark Zuckerberg,"[Mark Zuckerberg, Andrew McCollum, Eduardo Sav...",https://www.facebook.com/

In [306]:
val4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10682 entries, 0 to 10681
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              10682 non-null  object
 1   name                            10682 non-null  object
 2   world_rank                      10682 non-null  object
 3   annual_revenue_in_usd           8296 non-null   object
 4   annual_net_income_in_usd        8302 non-null   object
 5   annual_results_for_year_ending  8350 non-null   object
 6   total_assets_in_usd             7960 non-null   object
 7   total_liabilities_in_usd        7959 non-null   object
 8   total_equity_in_usd             7958 non-null   object
 9   headquarters_region_city        3380 non-null   object
 10  headquarters_country            10664 non-null  object
 11  headquarters_sub_region         10634 non-null  object
 12  headquarters_continent          10659 non-null  object
 13  company_business                10513 non-null  object
 14  number_of_employees             5451 non-null   object
 15  ceo                             1249 non-null   object
 16  founders                        394 non-null    object
 17  company_website                 10399 non-null  object
dtypes: object(18)
memory usage: 1.5+ MB

In [307]:
val4.dtypes

id                                object
name                              object
world_rank                        object
annual_revenue_in_usd             object
annual_net_income_in_usd          object
annual_results_for_year_ending    object
total_assets_in_usd               object
total_liabilities_in_usd          object
total_equity_in_usd               object
headquarters_region_city          object
headquarters_country              object
headquarters_sub_region           object
headquarters_continent            object
company_business                  object
number_of_employees               object
ceo                               object
founders                          object
company_website                   object
dtype: object

In [308]:
val4.isnull().sum()

id                                    0
name                                  0
world_rank                            0
annual_revenue_in_usd              2386
annual_net_income_in_usd           2380
annual_results_for_year_ending     2332
total_assets_in_usd                2722
total_liabilities_in_usd           2723
total_equity_in_usd                2724
headquarters_region_city           7302
headquarters_country                 18
headquarters_sub_region              48
headquarters_continent               23
company_business                    169
number_of_employees                5231
ceo                                9433
founders                          10288
company_website                     283
dtype: int64

In [309]:
val5 = pd.read_json('de-sources-2022-2023/value.today/GioPonSpiz-value.today.json')
val5.head()

,name,world_rank,marketValue,marketCap,CEO,country
0,APPLE,1,"2,825.000 Billion USD","2,510.000 Billion USD",Tim Cook,USA
1,MICROSOFT CORPORATION,2,"2,358.000 Billion USD","2,269.000 Billion USD",None,USA
2,SAUDI ARABIAN OIL COMPANY (Saudi Aramco),3,"1,889.600 Billion USD","1,891.600 Billion USD",H.E. Yasir Othman Al-Rumayyan,Saudi Arabia
3,ALPHABET,4,"1,820.000 Billion USD","1,934.000 Billion USD",John L. Hennessy,USA
4,AMAZON.COM,5,"1,649.000 Billion USD","1,758.000 Billion USD",Andy Jassy,USA

In [310]:
val5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10680 entries, 0 to 10679
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         10680 non-null  object
 1   world_rank   10680 non-null  object
 2   marketValue  10666 non-null  object
 3   marketCap    10571 non-null  object
 4   CEO          1094 non-null   object
 5   country      10680 non-null  object
dtypes: object(6)
memory usage: 500.8+ KB

In [311]:
val5.dtypes

name           object
world_rank     object
marketValue    object
marketCap      object
CEO            object
country        object
dtype: object

In [312]:
val5.isnull().sum()

name              0
world_rank        0
marketValue      14
marketCap       109
CEO            9586
country           0
dtype: int64

In [313]:
val6 = pd.read_json('de-sources-2022-2023/value.today/iGMM-value.today.json')
val6.head()

,name,ceo,market value (Jan-07-2022),world rank (Jan-07-2022),market value (Jan 1st 2020),world rank (Jan-2020),headquarters country,number of employees,company business,annual revenue in USD,annual net income in USD,company website
0,APPLE,Tim Cook,"2,825.000 Billion USD",1,"1,323.000 Billion USD",2.0,USA,"154,000","[Technology, Mobiles & Accessories, Electronics]","365,820 Million USD","94,680 Million USD",https://www.apple.com/
1,MICROSOFT CORPORATION,Satya Nadella,"2,358.000 Billion USD",2,"1,215.000 Billion USD",3.0,USA,"220,000","[Technology, Software and IT, Laptops]","198,270 Million USD","72,738 Million USD",https://www.microsoft.com/
2,SAUDI ARABIAN OIL COMPANY (Saudi Aramco),Amin H. Al-Nasser,"1,889.600 Billion USD",3,"1,898.100 Billion USD",1.0,Saudi Arabia,"79,800","[Energy, Oil and Gas, Chemicals]","400,460 Million USD","105,380 Million USD",https://www.saudiaramco.com/
3,ALPHABET,Sundar Pichai,"1,820.000 Billion USD",4,943.897 Billion USD,4.0,USA,"156,500","[Technology, Internet or Mobile App Based Busi...","257,640 Million USD","76,003 Million USD",https://abc.xyz/
4,AMAZON.COM,Andy Jassy,"1,649.000 Billion USD",5,941.028 Billion USD,5.0,USA,"1,335,000","[eCommerce, Internet or Mobile App Based Busin...","469,820 Million USD","33,364 Million USD",https://www.amazon.com/

In [314]:
val6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         10000 non-null  object
 1   ceo                          1249 non-null   object
 2   market value (Jan-07-2022)   9359 non-null   object
 3   world rank (Jan-07-2022)     10000 non-null  object
 4   market value (Jan 1st 2020)  8373 non-null   object
 5   world rank (Jan-2020)        8755 non-null   float64
 6   headquarters country         9986 non-null   object
 7   number of employees          5335 non-null   object
 8   company business             10000 non-null  object
 9   annual revenue in USD        7913 non-null   object
 10  annual net income in USD     7919 non-null   object
 11  company website              9751 non-null   object
dtypes: float64(1), object(11)
memory usage: 937.6+ KB

In [315]:
val6.dtypes

name                            object
ceo                             object
market value (Jan-07-2022)      object
world rank (Jan-07-2022)        object
market value (Jan 1st 2020)     object
world rank (Jan-2020)          float64
headquarters country            object
number of employees             object
company business                object
annual revenue in USD           object
annual net income in USD        object
company website                 object
dtype: object

In [316]:
val6.isnull().sum()

name                              0
ceo                            8751
market value (Jan-07-2022)      641
world rank (Jan-07-2022)          0
market value (Jan 1st 2020)    1627
world rank (Jan-2020)          1245
headquarters country             14
number of employees            4665
company business                  0
annual revenue in USD          2087
annual net income in USD       2081
company website                 249
dtype: int64

In [318]:
val7 = pd.read_json('de-sources-2022-2023/value.today/slytherin-value.today.json')
val7.head()

,link,rank,name,ceo,founded,revenue,country,industry
0,https://www.value.today/company/apple,1,APPLE,Tim Cook,1976,"365,820 Million USD",USA,"[Technology, Mobiles & Accessories, Electronic..."
1,https://www.value.today/company/taiwan-semicon...,10,TAIWAN SEMICONDUCTOR MANUFACTURING COMPANY (TSMC),Mark Liu,1987,"55,306 Million USD",Taiwan,"[Technology, Semiconductors, Electronics, Tech..."
2,https://www.value.today/company/microsoft-corp...,2,MICROSOFT CORPORATION,Satya Nadella,1975,"198,270 Million USD",USA,"[Technology, Software and IT, Laptops, Video G..."
3,https://www.value.today/company/nvidia-corpora...,9,NVIDIA CORPORATION,Jensen Huang,1993,"26,914 Million USD",USA,"[Technology, Semiconductors, Electronics, Tech..."
4,https://www.value.today/company/amazon.com,5,AMAZON.COM,Andy Jassy,1994,"469,820 Million USD",USA,"[eCommerce, Internet or Mobile App Based Busin..."

In [319]:
val7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   link      10000 non-null  object
 1   rank      10000 non-null  int64
 2   name      10000 non-null  object
 3   ceo       10000 non-null  object
 4   founded   10000 non-null  object
 5   revenue   10000 non-null  object
 6   country   10000 non-null  object
 7   industry  10000 non-null  object
dtypes: int64(1), object(7)
memory usage: 625.1+ KB

In [320]:
val7.dtypes

link        object
rank         int64
name        object
ceo         object
founded     object
revenue     object
country     object
industry    object
dtype: object

In [321]:
val7.isnull().sum()

link        0
rank        0
name        0
ceo         0
founded     0
revenue     0
country     0
industry    0
dtype: int64

### **wikipedia.org**

#### Formato .csv

In [322]:
wiki1 = pd.read_csv("de-sources-2022-2023/wikipedia.org/MarScoToc-wikipedia.csv")
wiki1.tail(10)

,Name,Industry,headQuarters,Founded,Area Served
609,Yandex,Internet Search engine Mapping Streaming servi...,Moscow,23 September 1997; 25 years ago (23 September ...,"Russia, Kazakhstan, Belarus, Uzbekistan, Azerb..."
610,Yokohama Rubber Company,Manufacturing,Moscow,"October 13, 1917; 105 years ago (1917-10-13)",NaN
611,Yamaha Motor Company,Automotive,Moscow,1 May 1955; 67 years ago (1955-05-01),Worldwide
612,Yum! Brands,Foodservice,Moscow,"October 6, 1997; 25 years ago (October 6, 1997)",Worldwide
613,Zara (retailer),Retail,Moscow,1975; 47 years ago (1975) (as Zorba) in Spain,Worldwide
614,Zensar Technologies,IT services,"Pune, India",1991[1],NaN
615,Guangzhou Zhujiang Brewery Group,Beverages,"Pune, India",1985,Worldwide
616,ZTE,Telecommunications equipment Networking equipment,NaN,1985; 37 years ago (1985) (as Zhongxing Semico...,Worldwide
617,Zippo,Manufacturing,Bradford,1932; 90 years ago (1932),NaN
618,Zyxel,Telecommunications,Hsinchu Science Park,"1989; 33 years ago (1989) in Hsinchu, Taiwan",Worldwide

In [323]:
wiki1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619 entries, 0 to 618
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          619 non-null    object
 1   Industry      619 non-null    object
 2   headQuarters  591 non-null    object
 3   Founded       619 non-null    object
 4   Area Served   383 non-null    object
dtypes: object(5)
memory usage: 24.3+ KB

In [324]:
wiki1.dtypes

Name            object
Industry        object
headQuarters    object
Founded         object
Area Served     object
dtype: object

In [325]:
wiki1.isnull().sum()

Name              0
Industry          0
headQuarters     28
Founded           0
Area Served     236
dtype: int64

#### Formato .json

In [326]:
wiki2 = pd.read_json('de-sources-2022-2023/wikipedia.org/DeBiGa-wikipedia.json')
wiki2.head()

,name,type,industry,founded,founders,headquarters,key_people,services,revenue,operating_income,total_assets,number_of_employees,website
0,Binance,[],[cryptocurrency industry ],[July 2017],"[ (""CZ""), Yi He]",[],[],[],[US$],[],[],[],"[www, .binance, .com]"
1,Gourmet Master Co. Ltd,[],[Food and Beverage],[2004],[],"[Taipei, Taiwan]",[],[],[NT$],[],[],[],"[www.85cafe.com, [1], www.85cbakerycafe.com]"
2,Tata Consultancy Services,[Public],"[Information technology, Consulting, Outsourcing]",[1968],[J. R. D. Tata],"[Mumbai, Maharashtra]",[],[],"[ , (US$25 billion), (2022)]","[ , ₹, 51,687 crore, (US$6.5 billion), [1], ...","[ , ₹, 141,514 crore, (US$18 billion), [2], ...","[616,171, [3], (October 2022)]","[www, .tcs, .com]"
3,"APMEX, Inc.",[Private],[precious metals],[2000],[],"[Oklahoma City, Oklahoma, United States]",[],[],[],[],[],[],[www.apmex.com]
4,Bitmain Technologies Ltd.,[Private],[Cryptocurrency],[2013],"[Micree Zhan, Jihan Wu]","[Beijing, China]",[],[],[],[],[],[],"[bitmain, .com]"

In [327]:
wiki2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1002 entries, 0 to 1001
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 1002 non-null   object
 1   type                 1002 non-null   object
 2   industry             1002 non-null   object
 3   founded              1002 non-null   object
 4   founders             1002 non-null   object
 5   headquarters         1002 non-null   object
 6   key_people           1002 non-null   object
 7   services             1002 non-null   object
 8   revenue              1002 non-null   object
 9   operating_income     1002 non-null   object
 10  total_assets         1002 non-null   object
 11  number_of_employees  1002 non-null   object
 12  website              1002 non-null   object
dtypes: object(13)
memory usage: 101.9+ KB

In [328]:
wiki2.dtypes

name                   object
type                   object
industry               object
founded                object
founders               object
headquarters           object
key_people             object
services               object
revenue                object
operating_income       object
total_assets           object
number_of_employees    object
website                object
dtype: object

In [329]:
wiki2.isnull().sum()

name                   0
type                   0
industry               0
founded                0
founders               0
headquarters           0
key_people             0
services               0
revenue                0
operating_income       0
total_assets           0
number_of_employees    0
website                0
dtype: int64

In [330]:
wiki3 = pd.read_json('de-sources-2022-2023/wikipedia.org/GioPonSpiz-wikipedia.org.json')
wiki3.head()

              Name        Industry                 Sector Headquarters Founded
0    3H Biomedical     Health care          Biotechnology      Uppsala    2004
1  AarhusKarlshamn  Consumer goods          Food products        Malmö    2005
2     Abba Seafood  Consumer goods          Food products   Gothenburg    1883
3       ABU Garcia  Consumer goods  Recreational products     Svängsta    1921
4           Acando      Technology               Software    Stockholm    2001

In [331]:
wiki3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2664 entries, 0 to 2663
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          2664 non-null   object
 1   Industry      2664 non-null   object
 2   Sector        2664 non-null   object
 3   Headquarters  2664 non-null   object
 4   Founded       2664 non-null   object
dtypes: object(5)
memory usage: 104.2+ KB

In [332]:
wiki3.dtypes

Name            object
Industry        object
Sector          object
Headquarters    object
Founded         object
dtype: object

In [333]:
wiki3.isnull().sum()

Name            0
Industry        0
Sector          0
Headquarters    0
Founded         0
dtype: int64

#### Formato .xls

In [334]:
wiki4 = pd.read_excel('de-sources-2022-2023/wikipedia.org/MalPatSaj-wikipedia.org.xls')
wiki4.head()

,Unnamed: 0,Name,Industry,Sector,Headquarters,Founded,Notes
0,0,Agrana,Consumer goods,Food products,Vienna,1988,"Sugar, starch, fruit juice concentrates and fr..."
1,1,pewag group,Industrials,Industrial machinery,Klagenfurt,1479,Chain manufacturer
2,2,AHT Cooling Systems,Industrials,Electronic equipment,Rottenmann,1983,Cooling and refrigeration
3,3,Ammerer Bed Company,Consumer goods,Durable household products,Ried im Innkreis,1763,NaN
4,4,ams AG,Technology,Semiconductors,Premstätten,1981,Semiconductors

In [335]:
wiki4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3111 entries, 0 to 3110
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    3111 non-null   int64
 1   Name          3111 non-null   object
 2   Industry      3111 non-null   object
 3   Sector        3110 non-null   object
 4   Headquarters  3111 non-null   object
 5   Founded       3110 non-null   object
 6   Notes         3099 non-null   object
dtypes: int64(1), object(6)
memory usage: 170.3+ KB

In [336]:
wiki4.dtypes

Unnamed: 0       int64
Name            object
Industry        object
Sector          object
Headquarters    object
Founded         object
Notes           object
dtype: object

In [337]:
wiki4.isnull().sum()

Unnamed: 0       0
Name             0
Industry         0
Sector           1
Headquarters     0
Founded          1
Notes           12
dtype: int64

### **Altre aziende**

#### AmbitionBox

In [338]:
ab = pd.read_csv("de-sources-2022-2023/altreAziende/MarScoToc-ambitionbox.com.csv")
ab.tail(5)

,Name,Industry,Headquarter,Ownership,Foundation Year
9894,Sterling Gtake E-Mobility,Auto Components,NaN,NaN,NaN
9895,Ashv Finance,NaN,NaN,NaN,NaN
9896,Wunderman Thompson Commerce,IT Services & Consulting,"Watford, United Kingdom (UK)",Private,1989 (34 yrs old)
9897,Optimus Pharma,Healthcare / Pharma,NaN,NaN,NaN
9898,SHOW OFF RETAIL,Retail,"Delhi,NCT, India",NaN,2016 (7 yrs old)

In [339]:
ab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9899 entries, 0 to 9898
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             9899 non-null   object
 1   Industry         9693 non-null   object
 2   Headquarter      9471 non-null   object
 3   Ownership        8226 non-null   object
 4   Foundation Year  9350 non-null   object
dtypes: object(5)
memory usage: 386.8+ KB

In [340]:
ab.dtypes

Name               object
Industry           object
Headquarter        object
Ownership          object
Foundation Year    object
dtype: object

In [341]:
ab.isnull().sum()

Name                  0
Industry            206
Headquarter         428
Ownership          1673
Foundation Year     549
dtype: int64

#### CampaignIndia

In [342]:
ci = pd.read_csv("de-sources-2022-2023/altreAziende/FR-campaignindia.csv")
ci.tail(5)

     RANK    BRAND NAME               CATEGORY MAIN MARKET  2010 RANK
995   996     Devondale         Dairy Products   Australia  New entry
996   997          More            Supermarket       India  New entry
997   998        Corona                   Beer    Regional  New entry
998   999  Harvey Fresh            Fruit Juice   Australia  New entry
999  1000        Gatsby  Male Skincare Product    Regional        953

In [343]:
ci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RANK         1000 non-null   int64
 1   BRAND NAME   1000 non-null   object
 2   CATEGORY     1000 non-null   object
 3   MAIN MARKET  1000 non-null   object
 4   2010 RANK    1000 non-null   object
dtypes: int64(1), object(4)
memory usage: 39.2+ KB

In [344]:
ci.dtypes

RANK            int64
BRAND NAME     object
CATEGORY       object
MAIN MARKET    object
2010 RANK      object
dtype: object

In [345]:
ci.isnull().sum()

RANK           0
BRAND NAME     0
CATEGORY       0
MAIN MARKET    0
2010 RANK      0
dtype: int64

#### CompanySocialUrls

In [346]:
csu = pd.read_csv("de-sources-2022-2023/altreAziende/FR-company_social_urls.csv")
csu.tail(5)

,Company,Facebook,Twitter,Instagram,Pinterest
843,The Hershey Company,https://www.facebook.com/HersheyCompany/,https://twitter.com/hersheycompany,https://www.instagram.com/hersheycompany/,https://www.pinterest.com/hersheycompany/
844,ITC,https://it-it.facebook.com/ITCooperativa/,https://twitter.com/search?q=%23itc,https://www.instagram.com/tgruiz24/?hl=it,https://www.pinterest.it/itcaccessories/
845,Pgnig Group,https://www.facebook.com/PGNiG/,https://twitter.com/search?q=%23pgnig,https://www.instagram.com/pgnig_od/,NaN
846,MTN Group,https://m.facebook.com/profile.php?id=10859005...,https://twitter.com/mtngroup,https://www.instagram.com/mtn.company/?hl=it,https://www.pinterest.it/mtn_company/
847,Compass Group,https://it-it.facebook.com/people/Compass-Grou...,https://twitter.com/compassgroupuk,https://www.instagram.com/compassgroupse/?hl=it,https://www.pinterest.it/pin/288652657357881873/

In [347]:
csu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 848 entries, 0 to 847
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Company    848 non-null    object
 1   Facebook   847 non-null    object
 2   Twitter    846 non-null    object
 3   Instagram  846 non-null    object
 4   Pinterest  663 non-null    object
dtypes: object(5)
memory usage: 33.2+ KB

In [348]:
csu.dtypes

Company      object
Facebook     object
Twitter      object
Instagram    object
Pinterest    object
dtype: object

In [349]:
csu.isnull().sum()

Company        0
Facebook       1
Twitter        2
Instagram      2
Pinterest    185
dtype: int64

#### TeamBlind

In [350]:
tb = pd.read_csv("de-sources-2022-2023/altreAziende/DDD-teamblind.com.csv")
tb.tail(5)

,Unnamed: 0,name,website,locations,size,industry,founded
941,941,Abiomed Careers,www.abiomed.com,"Danvers, MA","1,001 to 5,000 employees",Medical Device,1981
942,942,System Soft Technologies Careers,sstech.us,"Tampa, FL","501 to 1,000 employees",Information Technology & Services,1999
943,943,Anthem Careers,www.antheminc.com,"Indianapolis, Indiana","10,000+ employees",Financial Services,2004
944,944,Ad Hoc LLC Careers,adhoc.team,"Washington, DC",201 to 500 employees,Computer Software,2014
945,945,BETSOL Careers,www.betsol.com,"Broomfield, CO","501 to 1,000 employees",Information Technology & Services,2002

In [351]:
tb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 946 entries, 0 to 945
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  946 non-null    int64
 1   name        946 non-null    object
 2   website     946 non-null    object
 3   locations   946 non-null    object
 4   size        946 non-null    object
 5   industry    946 non-null    object
 6   founded     946 non-null    object
dtypes: int64(1), object(6)
memory usage: 51.9+ KB

In [352]:
tb.dtypes

Unnamed: 0     int64
name          object
website       object
locations     object
size          object
industry      object
founded       object
dtype: object

In [353]:
tb.isnull().sum()

Unnamed: 0    0
name          0
website       0
locations     0
size          0
industry      0
founded       0
dtype: int64

#### FamCapGermany

In [354]:
fcg = pd.read_csv("de-sources-2022-2023/altreAziende/FR-famcap_germany.csv")
fcg.tail(5)

,Rank,Company,Revenues 2018 $m,Employees,Family ownership,Founded,Public/Private,Generation,Family executive,Woman in leadership,Sector,Headquarters,State (abbreviation),Website
495,496,Mediengruppe Pre edruck,564.9,"3,600","Holland, Scherer",1945,Private,3,Yes,Yes,Media and Entertainment,Augsburg,BY,www.mediengruppe-pd.de
496,497,Index-Werke GmbH & Co. KG,563.6,"2,032",Hahn,1914,Private,N.A.,No,No,Industrial Manufacturing,E lingen,BW,www.index-werke.de
497,498,Dr. Theodor Stiebel Werke GmbH & Co. KG,557.2,"3,700",Stiebel,1924,Private,3,No,No,Financial Services,Holzminden,NI,www.stiebel-eltron.de
498,499,Amazonen-Werke H. Dreyer GmbH & Co. KG,557.1,"1,850",Dreyer,1883,Private,4,Yes,No,Industrial Manufacturing,Hasbergen,NI,www.amazone.de
499,500,W. Markgraf GmbH & Co KG Bauunternehmung,556.5,968,Markgraf,1932,Private,3,No,No,Industrial Manufacturing,Bayreuth,BY,www.markgraf-bau.de/

In [355]:
fcg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Rank                  500 non-null    int64
 1   Company               500 non-null    object
 2   Revenues 2018 $m      500 non-null    object
 3   Employees             500 non-null    object
 4   Family ownership      500 non-null    object
 5   Founded               500 non-null    int64
 6   Public/Private        500 non-null    object
 7   Generation            500 non-null    object
 8   Family executive      500 non-null    object
 9   Woman in leadership   500 non-null    object
 10  Sector                500 non-null    object
 11  Headquarters          500 non-null    object
 12  State (abbreviation)  500 non-null    object
 13  Website               500 non-null    object
dtypes: int64(2), object(12)
memory usage: 54.8+ KB

In [356]:
fcg.dtypes

Rank                     int64
Company                 object
Revenues 2018 $m        object
Employees               object
Family ownership        object
Founded                  int64
Public/Private          object
Generation              object
Family executive        object
Woman in leadership     object
Sector                  object
Headquarters            object
State (abbreviation)    object
Website                 object
dtype: object

In [357]:
fcg.isnull().sum()

Rank                    0
Company                 0
Revenues 2018 $m        0
Employees               0
Family ownership        0
Founded                 0
Public/Private          0
Generation              0
Family executive        0
Woman in leadership     0
Sector                  0
Headquarters            0
State (abbreviation)    0
Website                 0
dtype: int64

#### Followers

In [358]:
fol = pd.read_csv("de-sources-2022-2023/altreAziende/FR-followers.csv")
fol.tail(5)

,Company,Facebook,Twitter,Instagram,Pinterest
844,The Hershey Company,54.830 persone seguono questa Pagina,15.155,377K follower,"118,3mila follower"
845,ITC,-,-,"1,483 follower",45 follower
846,Pgnig Group,-,-,"2,710 follower",-
847,MTN Group,-,20.904,"3,086 follower",46 follower
848,Compass Group,-,15.540,"1,045 follower",-

In [359]:
fol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 849 entries, 0 to 848
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Company    849 non-null    object
 1   Facebook   849 non-null    object
 2   Twitter    849 non-null    object
 3   Instagram  848 non-null    object
 4   Pinterest  849 non-null    object
dtypes: object(5)
memory usage: 33.3+ KB

In [360]:
fol.dtypes

Company      object
Facebook     object
Twitter      object
Instagram    object
Pinterest    object
dtype: object

In [361]:
fol.isnull().sum()

Company      0
Facebook     0
Twitter      0
Instagram    1
Pinterest    0
dtype: int64

#### HitHorizons

In [362]:
hh = pd.read_json('de-sources-2022-2023/altreAziende/avengers-hithorizons.json', lines=True)
hh.head()

,id,name,address,nation,hhid,industry,sic_code,type,est_of_ownership
0,d60823f20d864692b517a8ad6c1418ed,Enel Spa,"VIALE REGINA MARGHERITA 137, ROMA, 00198, ROMA...",IT00934061003,H-IT0031426662,"Finance, Insurance, and Real Estate",Holding company (6719),Corporation,1962
1,c7856532ca8b4dd286a9602c77221035,Esselunga Spa,"VIA GIAMBOLOGNA 1, PIOLTELLO, 20096, MILANO, I...",IT04916380159,H-IT0068388950,Retail Trade,Ret mail-order house (5961),Corporation,1957
2,e8e04ae3e4594e3b836e62077155b19a,Superit Srl,"VIA VITTOR PISANI 20, MILANO, 20124, MILANO, I...",IT11068950960,H-IT0289899385,"Finance, Insurance, and Real Estate",Holding company (6719),Corporation,2019
3,37290f39faa54935813c0c6f840d7353,Saras Spa,"GALLERIA PASSARELLA 2, MILANO, 20122, MILANO, ...",IT00136440922,H-IT0018414451,Manufacturing,Petroleum refiner (2911),Corporation,1962
4,bb3a80a40f704c688f804f627667fd31,Unicredit Spa,"PIAZZA GAE AULENTI 3 TOWER A, MILANO, 20154, M...",IT00348170101,H-IT0009571558,"Finance, Insurance, and Real Estate",National commercial bank (6021),Corporation,1870

In [363]:
hh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 667 entries, 0 to 666
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                667 non-null    object
 1   name              667 non-null    object
 2   address           667 non-null    object
 3   nation            667 non-null    object
 4   hhid              667 non-null    object
 5   industry          667 non-null    object
 6   sic_code          667 non-null    object
 7   type              667 non-null    object
 8   est_of_ownership  667 non-null    int64
dtypes: int64(1), object(8)
memory usage: 47.0+ KB

In [364]:
hh.dtypes

id                  object
name                object
address             object
nation              object
hhid                object
industry            object
sic_code            object
type                object
est_of_ownership     int64
dtype: object

In [365]:
hh.isnull().sum()

id                  0
name                0
address             0
nation              0
hhid                0
industry            0
sic_code            0
type                0
est_of_ownership    0
dtype: int64

#### GlobalData

In [366]:
gd = pd.read_json('de-sources-2022-2023/altreAziende/DeBiGa-globaldata.json')
gd.head()

,name,headquarters,number_of_employees,address,industry,website,market_cap,telephone,revenue
0,US Ecology Inc,United States of America,"3,600","101 S Capitol Blvd Ste 1000, Boise, Idaho, 83702",Environmental and Waste Management Services,www.usecology.com,None,1 208 3318400,$988.0M
1,Mercury Systems Inc,United States of America,"2,386","50 Minuteman Drive, Andover, Massachusetts, 01810",Aerospace and Defense,www.mrcy.com,$2.7B,1 978 2561300,$988.2M
2,Xiwang Foodstuffs Co Ltd,China,"1,892","Xiwang Industrial Park, Zouping County, Binzho...",Consumer Packaged Goods,www.xwsp.cc,$787.4M,86 543 4868888,$985.2M
3,Shenzhen Hepalink Pharmaceutical Group Co Ltd,China,"2,046","No. 19, Hi-Tech Zhongyi Avenue, Middle Area, H...",Pharmaceuticals and Healthcare,www.hepalink.com,$2.7B,86 755 26980311,$986.9M
4,Kingsoft Corporation Ltd,Hong Kong,"7,174","Kingsoft Tower, No. 33, Xiaoying West Road, Ha...",Technology and Communications,www.kingsoft.com,$5.0B,852 24050088,$987.8M

In [367]:
gd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5336 entries, 0 to 5335
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 5336 non-null   object
 1   headquarters         5336 non-null   object
 2   number_of_employees  5233 non-null   object
 3   address              5336 non-null   object
 4   industry             5336 non-null   object
 5   website              5336 non-null   object
 6   market_cap           4914 non-null   object
 7   telephone            5242 non-null   object
 8   revenue              5336 non-null   object
dtypes: object(9)
memory usage: 375.3+ KB

In [368]:
gd.dtypes

name                   object
headquarters           object
number_of_employees    object
address                object
industry               object
website                object
market_cap             object
telephone              object
revenue                object
dtype: object

In [369]:
gd.isnull().sum()

name                     0
headquarters             0
number_of_employees    103
address                  0
industry                 0
website                  0
market_cap             422
telephone               94
revenue                  0
dtype: int64

#### GovUk

In [370]:
gu1 = pd.read_csv("de-sources-2022-2023/altreAziende/wissel-aziende-gov.uk.csv")
gu1.tail(5)

,URL,ID,Name,Company ID,Company Status,Company Type,Registration Date,Incorporation Date,Dissolution Date,Office Address
1316,https://find-and-update.company-information.se...,1317,P & A S HAYSELDEN LIMITED,04944953,Active,PrivatelimitedCompany,NaN,27 October 2003,NaN,61GreenStreetHoyland Barnsley SouthYorkshire S...
1317,https://find-and-update.company-information.se...,1318,P & A SHOPFITTING LIMITED,08948068,Active,PrivatelimitedCompany,NaN,19 March 2014,NaN,1bQueensway NewMilton Dorset UnitedKingdom BH2...
1318,https://find-and-update.company-information.se...,1319,P & A SIDGWICK LIMITED,12400905,Active,PrivatelimitedCompany,NaN,13 January 2020,NaN,TrevearHouseOldCountyCourt OldCountyCourt Penz...
1319,https://find-and-update.company-information.se...,1320,P & A SKIBINSKI CONTRACTORS LIMITED,03841278,Active,PrivatelimitedCompany,NaN,14 September 1999,NaN,9StationParade UxbridgeRoad London W53LD
1320,https://find-and-update.company-information.se...,1321,P & A SOFTWARE SOLUTIONS (UK) LIMITED,04332509,Active,PrivatelimitedCompany,NaN,30 November 2001,NaN,TheOldPinFactory 6bChurchStreet StonyStratford...

In [371]:
gu1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1321 entries, 0 to 1320
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   URL                 1321 non-null   object
 1   ID                  1321 non-null   int64
 2   Name                1321 non-null   object
 3   Company ID          1321 non-null   object
 4   Company Status      1318 non-null   object
 5   Company Type        1320 non-null   object
 6   Registration Date   15 non-null     object
 7   Incorporation Date  1306 non-null   object
 8   Dissolution Date    95 non-null     object
 9   Office Address      1317 non-null   object
dtypes: int64(1), object(9)
memory usage: 103.3+ KB

In [372]:
gu1.dtypes

URL                   object
ID                     int64
Name                  object
Company ID            object
Company Status        object
Company Type          object
Registration Date     object
Incorporation Date    object
Dissolution Date      object
Office Address        object
dtype: object

In [373]:
gu1.isnull().sum()

URL                      0
ID                       0
Name                     0
Company ID               0
Company Status           3
Company Type             1
Registration Date     1306
Incorporation Date      15
Dissolution Date      1226
Office Address           4
dtype: int64

In [374]:
gu2 = pd.read_json("de-sources-2022-2023/altreAziende/DeBiGa-govuk.json")
gu2.head()

,name,company_number,registered_office_address,company_status,company_type,company_creation_date,nature_of_business
0,INGRAM MICRO (UK) LIMITED,01609968,"Cbxii, 406-432 Midsummer Boulevard, Milton Key...",Active,Private limited Company,29 January 1982,"46510 - Wholesale of computers, computer perip..."
1,MARKETING FACILITIES MANAGEMENT LTD,04437088,"Jupiter House, Calleva Park, Aldermaston, Read...",Dissolved,Private limited Company,13 May 2002,74990 - Non-trading company
2,SOFTWARE LTD.,SC144127,"214 214 Holburn St, Aberdeen, Scotland, AB10 6DB",Active,Private limited Company,29 April 1993,62012 - Business and domestic software develop...
3,SPENEO TECHNOLOGIES LTD,04348149,"Suite B, 29 Harley Street, London, United King...",Dissolved,Private limited Company,7 January 2002,7499 - Non-trading company
4,SOFTWARE ADD-ONS LIMITED,05387424,"1 Bailey Court Bailey Court, Colburn Business ...",Active,Private limited Company,10 March 2005,62020 - Information technology consultancy act...

In [375]:
gu2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 7 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   name                       7000 non-null   object
 1   company_number             7000 non-null   object
 2   registered_office_address  7000 non-null   object
 3   company_status             7000 non-null   object
 4   company_type               7000 non-null   object
 5   company_creation_date      7000 non-null   object
 6   nature_of_business         7000 non-null   object
dtypes: object(7)
memory usage: 382.9+ KB

In [376]:
gu2.dtypes

name                         object
company_number               object
registered_office_address    object
company_status               object
company_type                 object
company_creation_date        object
nature_of_business           object
dtype: object

In [377]:
gu2.isnull().sum()

name                         0
company_number               0
registered_office_address    0
company_status               0
company_type                 0
company_creation_date        0
nature_of_business           0
dtype: int64

#### Sole24Ore

In [378]:
s24o = pd.read_csv("de-sources-2022-2023/altreAziende/FR-sole24ore.csv")
s24o.tail(5)

,Via Maurizio Gonzaga 5,Unnamed: 1,E-commerce,7.337,Winelivery S.r.l.
444,"Via Prima Dorsale Zir, Snc",Trapani,Vendita al dettaglio & all'ingrosso,3.117,Centro Sistemi Innovativi S.r.l.
445,Pescara 46,Atessa,Vendita al dettaglio & all’ingrosso,7.916,Color Max S.r.l.
446,Via G. Peroni 400/402,Roma,Consulenza manageriale,2.860,Ithude S.r.l.
447,"Viale Giuseppe Verdi,33",Salerno,Trasporti & logistica,7.247,GTProject S.r.l.
448,Via Cavour 54,Stornara,Trasporti & logistica,3.403,Transporent S.r.l.

In [379]:
s24o.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Via Maurizio Gonzaga 5  449 non-null    object
 1   Unnamed: 1              449 non-null    object
 2   E-commerce              449 non-null    object
 3   7.337                   449 non-null    float64
 4   Winelivery S.r.l.       449 non-null    object
dtypes: float64(1), object(4)
memory usage: 17.7+ KB

In [380]:
s24o.dtypes

Via Maurizio Gonzaga 5     object
Unnamed: 1                 object
E-commerce                 object
7.337                     float64
Winelivery S.r.l.          object
dtype: object

In [381]:
s24o.isnull().sum()

Via Maurizio Gonzaga 5    0
Unnamed: 1                0
E-commerce                0
7.337                     0
Winelivery S.r.l.         0
dtype: int64

#### Clipper

In [382]:
clip = pd.read_csv("de-sources-2022-2023/altreAziende/wissel-aziende-info-clipper.com.csv")
clip.tail(5)

,Unnamed: 0,INDEX,URL,Name,Trade Name,Address Name,Postalcode,City,State,Country,Location type
4651,4651,4651,https://www.info-clipper.com/en/company/united...,SOFTBANK ROBOTICS UK LTD,NaN,30 Old Bailey,EC4M 7AU,LONDON,UNITED KINGDOM,UNITED KINGDOM,Headquarter
4652,4652,4652,https://www.info-clipper.com/en/company/italy/...,COMUNE DI VOLLA,NaN,VIA ALDO MORO 1,80040,VOLLA,ITALY,ITALY,Single address
4653,4653,4653,https://www.info-clipper.com/en/company/united...,"SUDDATH RELOCATION SYSTEMS OF ORLANDO, INC",UNITED VAN LINES,4850 L B MCLEOD RD,328116410,ORLANDO,Florida(FL),UNITED STATES,Single address
4654,4654,4654,https://www.info-clipper.com/en/company/united...,MIDASPLAYER.COM LTD.,KING,Ampersand Building 178 Wardour Street,W1F 8FY,LONDON,UNITED KINGDOM,UNITED KINGDOM,Headquarter
4655,4655,4655,https://www.info-clipper.com/en/company/italy/...,DRILLMEC SPA,NaN,VIA I MAGGIO 12,29027,PODENZANO (GARIGA ),ITALY,ITALY,Headquarter

In [383]:
clip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4656 entries, 0 to 4655
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     4656 non-null   int64
 1   INDEX          4656 non-null   int64
 2   URL            4656 non-null   object
 3   Name           4656 non-null   object
 4   Trade Name     677 non-null    object
 5   Address Name   4656 non-null   object
 6   Postalcode     4656 non-null   object
 7   City           4656 non-null   object
 8   State          4656 non-null   object
 9   Country        4656 non-null   object
 10  Location type  4400 non-null   object
dtypes: int64(2), object(9)
memory usage: 400.2+ KB

In [384]:
clip.dtypes

Unnamed: 0        int64
INDEX             int64
URL              object
Name             object
Trade Name       object
Address Name     object
Postalcode       object
City             object
State            object
Country          object
Location type    object
dtype: object

In [385]:
clip.isnull().sum()

Unnamed: 0          0
INDEX               0
URL                 0
Name                0
Trade Name       3979
Address Name        0
Postalcode          0
City                0
State               0
Country             0
Location type     256
dtype: int64